Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x23b4 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 48 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x750bb): GNU C17 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu17 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x2a784): C:/Users/maxor/Documents/local_projects/HW-nahes_Programmieren/Graviermaschine/libs/LibRTOSConsole/src/Console.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x8bde2): C:/Users/maxor/Documents/local_projects/HW-nahes_Programmieren/Graviermaschine/stepper/Debug
    <1a>   DW_AT_ranges      : 0x27
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 49 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 8 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0xac61): size_t
    <36>   DW_AT_decl_file   : 4
    <37>   DW_AT_decl_line   : 214
    <38>   DW_AT_decl_column : 23
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 17 (DW_TAG_base_type)

    <95>   DW_AT_name        : (indirect string, offset: 0x76ce6): __uint64_t
    <99>   DW_AT_decl_file   : 5
    <9a>   DW_AT_decl_line   : 105
    <9b>   DW_AT_decl_column : 25
    <9c>   DW_AT_type        : <0xa0>
 <1><a0>: Abbrev Number: 17 (DW_TAG_base_type)
    <a1>   DW_AT_byte_size   : 8
    <a2>   DW_AT_encoding    : 7	(unsigned)
    <a3>   DW_AT_name        : (indirect string, offset: 0x35bad): long long unsigned int
 <1><a7>: Abbrev Number: 8 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x4bd5b): uint8_t
    <ac>   DW_AT_decl_file   : 6
    <ad>   DW_AT_decl_line   : 24
    <ae>   DW_AT_decl_column : 19
    <af>   DW_AT_type        : <0x59>
 <1><b3>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <b4>   DW_AT_type        : <0xa7>
 <1><b8>: Abbrev Number: 15 (DW_TAG_const_type)
    <b9>   DW_AT_type        : <0xa7>
 <1><bd>: Abbrev Number: 8 (DW_TAG_typedef)
    <be>   DW_AT_name        : (indirect string, offset: 0xb9e9c): uint32_t
    <c2>   DW_AT_decl_file   : 6
    <c3>   DW_AT_decl_line   : 48
    <c4>   DW_AT_decl_column : 20
    <c5>   DW_AT_type        : <0x81>
 <1><c9>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <ca>   DW_AT_type        : <0xbd>
 <1><ce>: Abbrev Number: 15 (DW_TAG_const_type)
    <cf>   DW_AT_type        : <0xc9>
 <1><d3>: Abbrev Number: 8 (DW_TAG_typedef)
    <d4>   DW_AT_name        : (indirect string, offset: 0x76ce8): uint64_t
    <d8>   DW_AT_decl_file   : 6
    <d9>   DW_AT_decl_line   : 60
    <da>   DW_AT_decl_column : 20
    <db>   DW_AT_type        : <0x94>
 <1><df>: Abbrev Number: 8 (DW_TAG_typedef)
    <e0>   DW_AT_name        : (indirect string, offset: 0x79f07): TaskFunction_t
    <e4>   DW_AT_decl_file   : 7
    <e5>   DW_AT_decl_line   : 36
    <e6>   DW_AT_decl_column : 17
    <e7>   DW_AT_type        : <0xeb>
 <1><eb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ec>   DW_AT_byte_size   : 4
    <ec>   DW_AT_type        : <0xf0>
 <1><f0>: Abbrev Number: 35 (DW_TAG_subroutine_type)
    <f1>   DW_AT_prototyped  : 1
    <f1>   DW_AT_sibling     : <0xfb>
 <2><f5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <f6>   DW_AT_type        : <0xfb>
 <2><fa>: Abbrev Number: 0
 <1><fb>: Abbrev Number: 50 (DW_TAG_pointer_type)
    <fc>   DW_AT_byte_size   : 4
 <1><fd>: Abbrev Number: 15 (DW_TAG_const_type)
    <fe>   DW_AT_type        : <0xfb>
 <1><102>: Abbrev Number: 8 (DW_TAG_typedef)
    <103>   DW_AT_name        : (indirect string, offset: 0xe997e): StackType_t
    <107>   DW_AT_decl_file   : 8
    <108>   DW_AT_decl_line   : 58
    <109>   DW_AT_decl_column : 26
    <10a>   DW_AT_type        : <0xbd>
 <1><10e>: Abbrev Number: 15 (DW_TAG_const_type)
    <10f>   DW_AT_type        : <0x102>
 <1><113>: Abbrev Number: 8 (DW_TAG_typedef)
    <114>   DW_AT_name        : (indirect string, offset: 0x1f16): BaseType_t
    <118>   DW_AT_decl_file   : 8
    <119>   DW_AT_decl_line   : 59
    <11a>   DW_AT_decl_column : 26
    <11b>   DW_AT_type        : <0x7a>
 <1><11f>: Abbrev Number: 8 (DW_TAG_typedef)
    <120>   DW_AT_name        : (indirect string, offset: 0x1f15): UBaseType_t
    <124>   DW_AT_decl_file   : 8
    <125>   DW_AT_decl_line   : 60
    <126>   DW_AT_decl_column : 26
    <127>   DW_AT_type        : <0x8d>
 <1><12b>: Abbrev Number: 15 (DW_TAG_const_type)
    <12c>   DW_AT_type        : <0x11f>
 <1><130>: Abbrev Number: 8 (DW_TAG_typedef)
    <131>   DW_AT_name        : (indirect string, offset: 0x8ce75): TickType_t
    <135>   DW_AT_decl_file   : 8
    <136>   DW_AT_decl_line   : 66
    <137>   DW_AT_decl_column : 26
    <138>   DW_AT_type        : <0xbd>
 <1><13c>: Abbrev Number: 15 (DW_TAG_const_type)
    <13d>   DW_AT_type        : <0x130>
 <1><141>: Abbrev Number: 36 (DW_TAG_typedef)
    <142>   DW_AT_name        : (indirect string, offset: 0xfd93f): wint_t
    <146>   DW_AT_decl_file   : 4
    <147>   DW_AT_decl_line   : 359
    <149>   DW_AT_decl_column : 23
    <14a>   DW_AT_type        : <0x3d>
 <1><14e>: Abbrev Number: 8 (DW_TAG_typedef)
    <14f>   DW_AT_name        : (indirect string, offset: 0x10354e): _off_t
    <153>   DW_AT_decl_file   : 9
    <154>   DW_AT_decl_line   : 46
    <155>   DW_AT_decl_column : 14
    <156>   DW_AT_type        : <0x7a>
 <1><15a>: Abbrev Number: 8 (DW_TAG_typedef)
    <15b>   DW_AT_name        : (indirect string, offset: 0x396f4): _fpos_t
    <15f>   DW_AT_decl_file   : 9
    <160>   DW_AT_decl_line   : 116
    <161>   DW_AT_decl_column : 14
    <162>   DW_AT_type        : <0x7a>
 <1><166>: Abbrev Number: 51 (DW_TAG_union_type)
    <167>   DW_AT_byte_size   : 4
    <168>   DW_AT_decl_file   : 9
    <169>   DW_AT_decl_line   : 165
    <16a>   DW_AT_decl_column : 3
    <16b>   DW_AT_sibling     : <0x186>
 <2><16f>: Abbrev Number: 40 (DW_TAG_member)
    <170>   DW_AT_name        : (indirect string, offset: 0xc36a3): __wch
    <174>   DW_AT_decl_file   : 9
    <174>   DW_AT_decl_line   : 167
    <175>   DW_AT_decl_column : 12
    <176>   DW_AT_type        : <0x141>
 <2><17a>: Abbrev Number: 40 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0x83f96): __wchb
    <17f>   DW_AT_decl_file   : 9
    <17f>   DW_AT_decl_line   : 168
    <180>   DW_AT_decl_column : 19
    <181>   DW_AT_type        : <0x186>
 <2><185>: Abbrev Number: 0
 <1><186>: Abbrev Number: 10 (DW_TAG_array_type)
    <187>   DW_AT_type        : <0x65>
    <18b>   DW_AT_sibling     : <0x196>
 <2><18f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <190>   DW_AT_type        : <0x3d>
    <194>   DW_AT_upper_bound : 3
 <2><195>: Abbrev Number: 0
 <1><196>: Abbrev Number: 37 (DW_TAG_structure_type)
    <197>   DW_AT_byte_size   : 8
    <198>   DW_AT_decl_file   : 9
    <199>   DW_AT_decl_line   : 162
    <19a>   DW_AT_decl_column : 9
    <19b>   DW_AT_sibling     : <0x1ba>
 <2><19f>: Abbrev Number: 3 (DW_TAG_member)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x48935): __count
    <1a4>   DW_AT_decl_file   : 9
    <1a5>   DW_AT_decl_line   : 164
    <1a6>   DW_AT_decl_column : 7
    <1a7>   DW_AT_type        : <0x2a>
    <1ab>   DW_AT_data_member_location: 0
 <2><1ac>: Abbrev Number: 3 (DW_TAG_member)
    <1ad>   DW_AT_name        : (indirect string, offset: 0x34a52): __value
    <1b1>   DW_AT_decl_file   : 9
    <1b2>   DW_AT_decl_line   : 169
    <1b3>   DW_AT_decl_column : 5
    <1b4>   DW_AT_type        : <0x166>
    <1b8>   DW_AT_data_member_location: 4
 <2><1b9>: Abbrev Number: 0
 <1><1ba>: Abbrev Number: 8 (DW_TAG_typedef)
    <1bb>   DW_AT_name        : (indirect string, offset: 0x85f78): _mbstate_t
    <1bf>   DW_AT_decl_file   : 9
    <1c0>   DW_AT_decl_line   : 170
    <1c1>   DW_AT_decl_column : 3
    <1c2>   DW_AT_type        : <0x196>
 <1><1c6>: Abbrev Number: 8 (DW_TAG_typedef)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x8a8a1): __ULong
    <1cb>   DW_AT_decl_file   : 10
    <1cc>   DW_AT_decl_line   : 23
    <1cd>   DW_AT_decl_column : 25
    <1ce>   DW_AT_type        : <0x8d>
 <1><1d2>: Abbrev Number: 8 (DW_TAG_typedef)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x8c51e): _LOCK_T
    <1d7>   DW_AT_decl_file   : 11
    <1d8>   DW_AT_decl_line   : 34
    <1d9>   DW_AT_decl_column : 25
    <1da>   DW_AT_type        : <0x1de>
 <1><1de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1df>   DW_AT_byte_size   : 4
    <1df>   DW_AT_type        : <0x1e3>
 <1><1e3>: Abbrev Number: 30 (DW_TAG_structure_type)
    <1e4>   DW_AT_name        : (indirect string, offset: 0x20ec8): __lock
    <1e8>   DW_AT_declaration : 1
 <1><1e8>: Abbrev Number: 8 (DW_TAG_typedef)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x7ec27): _flock_t
    <1ed>   DW_AT_decl_file   : 10
    <1ee>   DW_AT_decl_line   : 36
    <1ef>   DW_AT_decl_column : 27
    <1f0>   DW_AT_type        : <0x1d2>
 <1><1f4>: Abbrev Number: 23 (DW_TAG_structure_type)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x5a60c): _Bigint
    <1f9>   DW_AT_byte_size   : 24
    <1fa>   DW_AT_decl_file   : 10
    <1fb>   DW_AT_decl_line   : 53
    <1fc>   DW_AT_decl_column : 8
    <1fd>   DW_AT_sibling     : <0x24e>
 <2><201>: Abbrev Number: 3 (DW_TAG_member)
    <202>   DW_AT_name        : (indirect string, offset: 0x97e79): _next
    <206>   DW_AT_decl_file   : 10
    <207>   DW_AT_decl_line   : 55
    <208>   DW_AT_decl_column : 19
    <209>   DW_AT_type        : <0x24e>
    <20d>   DW_AT_data_member_location: 0
 <2><20e>: Abbrev Number: 18 (DW_TAG_member)
    <20f>   DW_AT_name        : _k
    <212>   DW_AT_decl_file   : 10
    <213>   DW_AT_decl_line   : 56
    <214>   DW_AT_decl_column : 7
    <215>   DW_AT_type        : <0x2a>
    <219>   DW_AT_data_member_location: 4
 <2><21a>: Abbrev Number: 3 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0xb7358): _maxwds
    <21f>   DW_AT_decl_file   : 10
    <220>   DW_AT_decl_line   : 56
    <221>   DW_AT_decl_column : 11
    <222>   DW_AT_type        : <0x2a>
    <226>   DW_AT_data_member_location: 8
 <2><227>: Abbrev Number: 3 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0x88592): _sign
    <22c>   DW_AT_decl_file   : 10
    <22d>   DW_AT_decl_line   : 56
    <22e>   DW_AT_decl_column : 20
    <22f>   DW_AT_type        : <0x2a>
    <233>   DW_AT_data_member_location: 12
 <2><234>: Abbrev Number: 3 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x88048): _wds
    <239>   DW_AT_decl_file   : 10
    <23a>   DW_AT_decl_line   : 56
    <23b>   DW_AT_decl_column : 27
    <23c>   DW_AT_type        : <0x2a>
    <240>   DW_AT_data_member_location: 16
 <2><241>: Abbrev Number: 18 (DW_TAG_member)
    <242>   DW_AT_name        : _x
    <245>   DW_AT_decl_file   : 10
    <246>   DW_AT_decl_line   : 57
    <247>   DW_AT_decl_column : 11
    <248>   DW_AT_type        : <0x253>
    <24c>   DW_AT_data_member_location: 20
 <2><24d>: Abbrev Number: 0
 <1><24e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <24f>   DW_AT_byte_size   : 4
    <24f>   DW_AT_type        : <0x1f4>
 <1><253>: Abbrev Number: 10 (DW_TAG_array_type)
    <254>   DW_AT_type        : <0x1c6>
    <258>   DW_AT_sibling     : <0x263>
 <2><25c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <25d>   DW_AT_type        : <0x3d>
    <261>   DW_AT_upper_bound : 0
 <2><262>: Abbrev Number: 0
 <1><263>: Abbrev Number: 23 (DW_TAG_structure_type)
    <264>   DW_AT_name        : (indirect string, offset: 0x466c0): __tm
    <268>   DW_AT_byte_size   : 36
    <269>   DW_AT_decl_file   : 10
    <26a>   DW_AT_decl_line   : 61
    <26b>   DW_AT_decl_column : 8
    <26c>   DW_AT_sibling     : <0x2e6>
 <2><270>: Abbrev Number: 3 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0xd0cc3): __tm_sec
    <275>   DW_AT_decl_file   : 10
    <276>   DW_AT_decl_line   : 63
    <277>   DW_AT_decl_column : 9
    <278>   DW_AT_type        : <0x2a>
    <27c>   DW_AT_data_member_location: 0
 <2><27d>: Abbrev Number: 3 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0x14f9): __tm_min
    <282>   DW_AT_decl_file   : 10
    <283>   DW_AT_decl_line   : 64
    <284>   DW_AT_decl_column : 9
    <285>   DW_AT_type        : <0x2a>
    <289>   DW_AT_data_member_location: 4
 <2><28a>: Abbrev Number: 3 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x375e1): __tm_hour
    <28f>   DW_AT_decl_file   : 10
    <290>   DW_AT_decl_line   : 65
    <291>   DW_AT_decl_column : 9
    <292>   DW_AT_type        : <0x2a>
    <296>   DW_AT_data_member_location: 8
 <2><297>: Abbrev Number: 3 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0x95890): __tm_mday
    <29c>   DW_AT_decl_file   : 10
    <29d>   DW_AT_decl_line   : 66
    <29e>   DW_AT_decl_column : 9
    <29f>   DW_AT_type        : <0x2a>
    <2a3>   DW_AT_data_member_location: 12
 <2><2a4>: Abbrev Number: 3 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x4433): __tm_mon
    <2a9>   DW_AT_decl_file   : 10
    <2aa>   DW_AT_decl_line   : 67
    <2ab>   DW_AT_decl_column : 9
    <2ac>   DW_AT_type        : <0x2a>
    <2b0>   DW_AT_data_member_location: 16
 <2><2b1>: Abbrev Number: 3 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x991d7): __tm_year
    <2b6>   DW_AT_decl_file   : 10
    <2b7>   DW_AT_decl_line   : 68
    <2b8>   DW_AT_decl_column : 9
    <2b9>   DW_AT_type        : <0x2a>
    <2bd>   DW_AT_data_member_location: 20
 <2><2be>: Abbrev Number: 3 (DW_TAG_member)
    <2bf>   DW_AT_name        : (indirect string, offset: 0x6d47e): __tm_wday
    <2c3>   DW_AT_decl_file   : 10
    <2c4>   DW_AT_decl_line   : 69
    <2c5>   DW_AT_decl_column : 9
    <2c6>   DW_AT_type        : <0x2a>
    <2ca>   DW_AT_data_member_location: 24
 <2><2cb>: Abbrev Number: 3 (DW_TAG_member)
    <2cc>   DW_AT_name        : (indirect string, offset: 0xc9f42): __tm_yday
    <2d0>   DW_AT_decl_file   : 10
    <2d1>   DW_AT_decl_line   : 70
    <2d2>   DW_AT_decl_column : 9
    <2d3>   DW_AT_type        : <0x2a>
    <2d7>   DW_AT_data_member_location: 28
 <2><2d8>: Abbrev Number: 3 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0xe4bc8): __tm_isdst
    <2dd>   DW_AT_decl_file   : 10
    <2de>   DW_AT_decl_line   : 71
    <2df>   DW_AT_decl_column : 9
    <2e0>   DW_AT_type        : <0x2a>
    <2e4>   DW_AT_data_member_location: 32
 <2><2e5>: Abbrev Number: 0
 <1><2e6>: Abbrev Number: 23 (DW_TAG_structure_type)
    <2e7>   DW_AT_name        : (indirect string, offset: 0xab875): __sbuf
    <2eb>   DW_AT_byte_size   : 8
    <2ec>   DW_AT_decl_file   : 10
    <2ed>   DW_AT_decl_line   : 116
    <2ee>   DW_AT_decl_column : 8
    <2ef>   DW_AT_sibling     : <0x30e>
 <2><2f3>: Abbrev Number: 3 (DW_TAG_member)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x104ff5): _base
    <2f8>   DW_AT_decl_file   : 10
    <2f9>   DW_AT_decl_line   : 117
    <2fa>   DW_AT_decl_column : 17
    <2fb>   DW_AT_type        : <0x30e>
    <2ff>   DW_AT_data_member_location: 0
 <2><300>: Abbrev Number: 3 (DW_TAG_member)
    <301>   DW_AT_name        : (indirect string, offset: 0x47181): _size
    <305>   DW_AT_decl_file   : 10
    <306>   DW_AT_decl_line   : 118
    <307>   DW_AT_decl_column : 6
    <308>   DW_AT_type        : <0x2a>
    <30c>   DW_AT_data_member_location: 4
 <2><30d>: Abbrev Number: 0
 <1><30e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <30f>   DW_AT_byte_size   : 4
    <30f>   DW_AT_type        : <0x65>
 <1><313>: Abbrev Number: 23 (DW_TAG_structure_type)
    <314>   DW_AT_name        : (indirect string, offset: 0xc325c): __sFILE
    <318>   DW_AT_byte_size   : 104
    <319>   DW_AT_decl_file   : 10
    <31a>   DW_AT_decl_line   : 153
    <31b>   DW_AT_decl_column : 8
    <31c>   DW_AT_sibling     : <0x456>
 <2><320>: Abbrev Number: 18 (DW_TAG_member)
    <321>   DW_AT_name        : _p
    <324>   DW_AT_decl_file   : 10
    <325>   DW_AT_decl_line   : 154
    <326>   DW_AT_decl_column : 18
    <327>   DW_AT_type        : <0x30e>
    <32b>   DW_AT_data_member_location: 0
 <2><32c>: Abbrev Number: 18 (DW_TAG_member)
    <32d>   DW_AT_name        : _r
    <330>   DW_AT_decl_file   : 10
    <331>   DW_AT_decl_line   : 155
    <332>   DW_AT_decl_column : 7
    <333>   DW_AT_type        : <0x2a>
    <337>   DW_AT_data_member_location: 4
 <2><338>: Abbrev Number: 18 (DW_TAG_member)
    <339>   DW_AT_name        : _w
    <33c>   DW_AT_decl_file   : 10
    <33d>   DW_AT_decl_line   : 156
    <33e>   DW_AT_decl_column : 7
    <33f>   DW_AT_type        : <0x2a>
    <343>   DW_AT_data_member_location: 8
 <2><344>: Abbrev Number: 3 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0x75ccc): _flags
    <349>   DW_AT_decl_file   : 10
    <34a>   DW_AT_decl_line   : 157
    <34b>   DW_AT_decl_column : 9
    <34c>   DW_AT_type        : <0x6c>
    <350>   DW_AT_data_member_location: 12
 <2><351>: Abbrev Number: 3 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0x27300): _file
    <356>   DW_AT_decl_file   : 10
    <357>   DW_AT_decl_line   : 158
    <358>   DW_AT_decl_column : 9
    <359>   DW_AT_type        : <0x6c>
    <35d>   DW_AT_data_member_location: 14
 <2><35e>: Abbrev Number: 18 (DW_TAG_member)
    <35f>   DW_AT_name        : _bf
    <363>   DW_AT_decl_file   : 10
    <364>   DW_AT_decl_line   : 159
    <365>   DW_AT_decl_column : 17
    <366>   DW_AT_type        : <0x2e6>
    <36a>   DW_AT_data_member_location: 16
 <2><36b>: Abbrev Number: 3 (DW_TAG_member)
    <36c>   DW_AT_name        : (indirect string, offset: 0x76322): _lbfsize
    <370>   DW_AT_decl_file   : 10
    <371>   DW_AT_decl_line   : 160
    <372>   DW_AT_decl_column : 7
    <373>   DW_AT_type        : <0x2a>
    <377>   DW_AT_data_member_location: 24
 <2><378>: Abbrev Number: 3 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0x108511): _data
    <37d>   DW_AT_decl_file   : 10
    <37e>   DW_AT_decl_line   : 163
    <37f>   DW_AT_decl_column : 18
    <380>   DW_AT_type        : <0x56c>
    <384>   DW_AT_data_member_location: 28
 <2><385>: Abbrev Number: 3 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0xa4c34): _cookie
    <38a>   DW_AT_decl_file   : 10
    <38b>   DW_AT_decl_line   : 167
    <38c>   DW_AT_decl_column : 10
    <38d>   DW_AT_type        : <0xfb>
    <391>   DW_AT_data_member_location: 32
 <2><392>: Abbrev Number: 3 (DW_TAG_member)
    <393>   DW_AT_name        : (indirect string, offset: 0xc9254): _read
    <397>   DW_AT_decl_file   : 10
    <398>   DW_AT_decl_line   : 169
    <399>   DW_AT_decl_column : 29
    <39a>   DW_AT_type        : <0x5a5>
    <39e>   DW_AT_data_member_location: 36
 <2><39f>: Abbrev Number: 3 (DW_TAG_member)
    <3a0>   DW_AT_name        : (indirect string, offset: 0x20f0b): _write
    <3a4>   DW_AT_decl_file   : 10
    <3a5>   DW_AT_decl_line   : 171
    <3a6>   DW_AT_decl_column : 29
    <3a7>   DW_AT_type        : <0x5d7>
    <3ab>   DW_AT_data_member_location: 40
 <2><3ac>: Abbrev Number: 3 (DW_TAG_member)
    <3ad>   DW_AT_name        : (indirect string, offset: 0xf9489): _seek
    <3b1>   DW_AT_decl_file   : 10
    <3b2>   DW_AT_decl_line   : 174
    <3b3>   DW_AT_decl_column : 13
    <3b4>   DW_AT_type        : <0x5fa>
    <3b8>   DW_AT_data_member_location: 44
 <2><3b9>: Abbrev Number: 3 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x71618): _close
    <3be>   DW_AT_decl_file   : 10
    <3bf>   DW_AT_decl_line   : 175
    <3c0>   DW_AT_decl_column : 9
    <3c1>   DW_AT_type        : <0x613>
    <3c5>   DW_AT_data_member_location: 48
 <2><3c6>: Abbrev Number: 18 (DW_TAG_member)
    <3c7>   DW_AT_name        : _ub
    <3cb>   DW_AT_decl_file   : 10
    <3cc>   DW_AT_decl_line   : 178
    <3cd>   DW_AT_decl_column : 17
    <3ce>   DW_AT_type        : <0x2e6>
    <3d2>   DW_AT_data_member_location: 52
 <2><3d3>: Abbrev Number: 18 (DW_TAG_member)
    <3d4>   DW_AT_name        : _up
    <3d8>   DW_AT_decl_file   : 10
    <3d9>   DW_AT_decl_line   : 179
    <3da>   DW_AT_decl_column : 18
    <3db>   DW_AT_type        : <0x30e>
    <3df>   DW_AT_data_member_location: 60
 <2><3e0>: Abbrev Number: 18 (DW_TAG_member)
    <3e1>   DW_AT_name        : _ur
    <3e5>   DW_AT_decl_file   : 10
    <3e6>   DW_AT_decl_line   : 180
    <3e7>   DW_AT_decl_column : 7
    <3e8>   DW_AT_type        : <0x2a>
    <3ec>   DW_AT_data_member_location: 64
 <2><3ed>: Abbrev Number: 3 (DW_TAG_member)
    <3ee>   DW_AT_name        : (indirect string, offset: 0xf65bf): _ubuf
    <3f2>   DW_AT_decl_file   : 10
    <3f3>   DW_AT_decl_line   : 183
    <3f4>   DW_AT_decl_column : 17
    <3f5>   DW_AT_type        : <0x618>
    <3f9>   DW_AT_data_member_location: 68
 <2><3fa>: Abbrev Number: 3 (DW_TAG_member)
    <3fb>   DW_AT_name        : (indirect string, offset: 0xaec9f): _nbuf
    <3ff>   DW_AT_decl_file   : 10
    <400>   DW_AT_decl_line   : 184
    <401>   DW_AT_decl_column : 17
    <402>   DW_AT_type        : <0x628>
    <406>   DW_AT_data_member_location: 71
 <2><407>: Abbrev Number: 18 (DW_TAG_member)
    <408>   DW_AT_name        : _lb
    <40c>   DW_AT_decl_file   : 10
    <40d>   DW_AT_decl_line   : 187
    <40e>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0x2e6>
    <413>   DW_AT_data_member_location: 72
 <2><414>: Abbrev Number: 3 (DW_TAG_member)
    <415>   DW_AT_name        : (indirect string, offset: 0x1022eb): _blksize
    <419>   DW_AT_decl_file   : 10
    <41a>   DW_AT_decl_line   : 190
    <41b>   DW_AT_decl_column : 7
    <41c>   DW_AT_type        : <0x2a>
    <420>   DW_AT_data_member_location: 80
 <2><421>: Abbrev Number: 3 (DW_TAG_member)
    <422>   DW_AT_name        : (indirect string, offset: 0x53c5c): _offset
    <426>   DW_AT_decl_file   : 10
    <427>   DW_AT_decl_line   : 191
    <428>   DW_AT_decl_column : 10
    <429>   DW_AT_type        : <0x14e>
    <42d>   DW_AT_data_member_location: 84
 <2><42e>: Abbrev Number: 3 (DW_TAG_member)
    <42f>   DW_AT_name        : (indirect string, offset: 0x20ec9): _lock
    <433>   DW_AT_decl_file   : 10
    <434>   DW_AT_decl_line   : 198
    <435>   DW_AT_decl_column : 12
    <436>   DW_AT_type        : <0x1e8>
    <43a>   DW_AT_data_member_location: 88
 <2><43b>: Abbrev Number: 3 (DW_TAG_member)
    <43c>   DW_AT_name        : (indirect string, offset: 0x1dfe2): _mbstate
    <440>   DW_AT_decl_file   : 10
    <441>   DW_AT_decl_line   : 200
    <442>   DW_AT_decl_column : 14
    <443>   DW_AT_type        : <0x1ba>
    <447>   DW_AT_data_member_location: 92
 <2><448>: Abbrev Number: 3 (DW_TAG_member)
    <449>   DW_AT_name        : (indirect string, offset: 0xcf541): _flags2
    <44d>   DW_AT_decl_file   : 10
    <44e>   DW_AT_decl_line   : 201
    <44f>   DW_AT_decl_column : 9
    <450>   DW_AT_type        : <0x2a>
    <454>   DW_AT_data_member_location: 100
 <2><455>: Abbrev Number: 0
 <1><456>: Abbrev Number: 31 (DW_TAG_structure_type)
    <457>   DW_AT_name        : (indirect string, offset: 0xe722d): _reent
    <45b>   DW_AT_byte_size   : 76
    <45c>   DW_AT_decl_file   : 10
    <45c>   DW_AT_decl_line   : 379
    <45e>   DW_AT_decl_column : 8
    <45e>   DW_AT_sibling     : <0x56c>
 <2><462>: Abbrev Number: 4 (DW_TAG_member)
    <463>   DW_AT_name        : (indirect string, offset: 0x102433): _errno
    <467>   DW_AT_decl_file   : 10
    <468>   DW_AT_decl_line   : 383
    <46a>   DW_AT_decl_column : 7
    <46b>   DW_AT_type        : <0x2a>
    <46f>   DW_AT_data_member_location: 0
 <2><470>: Abbrev Number: 4 (DW_TAG_member)
    <471>   DW_AT_name        : (indirect string, offset: 0x81fba): _stdin
    <475>   DW_AT_decl_file   : 10
    <476>   DW_AT_decl_line   : 388
    <478>   DW_AT_decl_column : 11
    <479>   DW_AT_type        : <0x661>
    <47d>   DW_AT_data_member_location: 4
 <2><47e>: Abbrev Number: 4 (DW_TAG_member)
    <47f>   DW_AT_name        : (indirect string, offset: 0xb0715): _stdout
    <483>   DW_AT_decl_file   : 10
    <484>   DW_AT_decl_line   : 388
    <486>   DW_AT_decl_column : 20
    <487>   DW_AT_type        : <0x661>
    <48b>   DW_AT_data_member_location: 8
 <2><48c>: Abbrev Number: 4 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0xe775d): _stderr
    <491>   DW_AT_decl_file   : 10
    <492>   DW_AT_decl_line   : 388
    <494>   DW_AT_decl_column : 30
    <495>   DW_AT_type        : <0x661>
    <499>   DW_AT_data_member_location: 12
 <2><49a>: Abbrev Number: 4 (DW_TAG_member)
    <49b>   DW_AT_name        : (indirect string, offset: 0xa201c): _inc
    <49f>   DW_AT_decl_file   : 10
    <4a0>   DW_AT_decl_line   : 390
    <4a2>   DW_AT_decl_column : 8
    <4a3>   DW_AT_type        : <0x2a>
    <4a7>   DW_AT_data_member_location: 16
 <2><4a8>: Abbrev Number: 4 (DW_TAG_member)
    <4a9>   DW_AT_name        : (indirect string, offset: 0xc9638): _emergency
    <4ad>   DW_AT_decl_file   : 10
    <4ae>   DW_AT_decl_line   : 392
    <4b0>   DW_AT_decl_column : 9
    <4b1>   DW_AT_type        : <0x58f>
    <4b5>   DW_AT_data_member_location: 20
 <2><4b6>: Abbrev Number: 4 (DW_TAG_member)
    <4b7>   DW_AT_name        : (indirect string, offset: 0xe1042): _locale
    <4bb>   DW_AT_decl_file   : 10
    <4bc>   DW_AT_decl_line   : 398
    <4be>   DW_AT_decl_column : 22
    <4bf>   DW_AT_type        : <0x7c1>
    <4c3>   DW_AT_data_member_location: 24
 <2><4c4>: Abbrev Number: 32 (DW_TAG_member)
    <4c5>   DW_AT_name        : _mp
    <4c9>   DW_AT_decl_file   : 10
    <4ca>   DW_AT_decl_line   : 400
    <4cc>   DW_AT_decl_column : 18
    <4cc>   DW_AT_type        : <0x7c6>
    <4d0>   DW_AT_data_member_location: 28
 <2><4d1>: Abbrev Number: 4 (DW_TAG_member)
    <4d2>   DW_AT_name        : (indirect string, offset: 0x63b81): __cleanup
    <4d6>   DW_AT_decl_file   : 10
    <4d7>   DW_AT_decl_line   : 402
    <4d9>   DW_AT_decl_column : 10
    <4da>   DW_AT_type        : <0x7d6>
    <4de>   DW_AT_data_member_location: 32
 <2><4df>: Abbrev Number: 4 (DW_TAG_member)
    <4e0>   DW_AT_name        : (indirect string, offset: 0x40aa0): _gamma_signgam
    <4e4>   DW_AT_decl_file   : 10
    <4e5>   DW_AT_decl_line   : 404
    <4e7>   DW_AT_decl_column : 7
    <4e8>   DW_AT_type        : <0x2a>
    <4ec>   DW_AT_data_member_location: 36
 <2><4ed>: Abbrev Number: 4 (DW_TAG_member)
    <4ee>   DW_AT_name        : (indirect string, offset: 0xbbebe): _cvtlen
    <4f2>   DW_AT_decl_file   : 10
    <4f3>   DW_AT_decl_line   : 407
    <4f5>   DW_AT_decl_column : 7
    <4f6>   DW_AT_type        : <0x2a>
    <4fa>   DW_AT_data_member_location: 40
 <2><4fb>: Abbrev Number: 4 (DW_TAG_member)
    <4fc>   DW_AT_name        : (indirect string, offset: 0x7713c): _cvtbuf
    <500>   DW_AT_decl_file   : 10
    <501>   DW_AT_decl_line   : 408
    <503>   DW_AT_decl_column : 9
    <504>   DW_AT_type        : <0x58f>
    <508>   DW_AT_data_member_location: 44
 <2><509>: Abbrev Number: 4 (DW_TAG_member)
    <50a>   DW_AT_name        : (indirect string, offset: 0xbe730): _r48
    <50e>   DW_AT_decl_file   : 10
    <50f>   DW_AT_decl_line   : 410
    <511>   DW_AT_decl_column : 19
    <512>   DW_AT_type        : <0x7db>
    <516>   DW_AT_data_member_location: 48
 <2><517>: Abbrev Number: 4 (DW_TAG_member)
    <518>   DW_AT_name        : (indirect string, offset: 0xd3a61): _localtime_buf
    <51c>   DW_AT_decl_file   : 10
    <51d>   DW_AT_decl_line   : 411
    <51f>   DW_AT_decl_column : 16
    <520>   DW_AT_type        : <0x7e0>
    <524>   DW_AT_data_member_location: 52
 <2><525>: Abbrev Number: 4 (DW_TAG_member)
    <526>   DW_AT_name        : (indirect string, offset: 0x3cedc): _asctime_buf
    <52a>   DW_AT_decl_file   : 10
    <52b>   DW_AT_decl_line   : 412
    <52d>   DW_AT_decl_column : 9
    <52e>   DW_AT_type        : <0x58f>
    <532>   DW_AT_data_member_location: 56
 <2><533>: Abbrev Number: 4 (DW_TAG_member)
    <534>   DW_AT_name        : (indirect string, offset: 0x34b68): _sig_func
    <538>   DW_AT_decl_file   : 10
    <539>   DW_AT_decl_line   : 415
    <53b>   DW_AT_decl_column : 12
    <53c>   DW_AT_type        : <0x7f0>
    <540>   DW_AT_data_member_location: 60
 <2><541>: Abbrev Number: 4 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0x45ddc): __sf
    <546>   DW_AT_decl_file   : 10
    <547>   DW_AT_decl_line   : 423
    <549>   DW_AT_decl_column : 11
    <54a>   DW_AT_type        : <0x661>
    <54e>   DW_AT_data_member_location: 64
 <2><54f>: Abbrev Number: 4 (DW_TAG_member)
    <550>   DW_AT_name        : (indirect string, offset: 0x74a40): _misc
    <554>   DW_AT_decl_file   : 10
    <555>   DW_AT_decl_line   : 424
    <557>   DW_AT_decl_column : 23
    <558>   DW_AT_type        : <0x7fa>
    <55c>   DW_AT_data_member_location: 68
 <2><55d>: Abbrev Number: 4 (DW_TAG_member)
    <55e>   DW_AT_name        : (indirect string, offset: 0x9f39d): _signal_buf
    <562>   DW_AT_decl_file   : 10
    <563>   DW_AT_decl_line   : 425
    <565>   DW_AT_decl_column : 9
    <566>   DW_AT_type        : <0x58f>
    <56a>   DW_AT_data_member_location: 72
 <2><56b>: Abbrev Number: 0
 <1><56c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <56d>   DW_AT_byte_size   : 4
    <56d>   DW_AT_type        : <0x456>
 <1><571>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <572>   DW_AT_prototyped  : 1
    <572>   DW_AT_type        : <0x2a>
    <576>   DW_AT_sibling     : <0x58f>
 <2><57a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <57b>   DW_AT_type        : <0x56c>
 <2><57f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <580>   DW_AT_type        : <0xfb>
 <2><584>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <585>   DW_AT_type        : <0x58f>
 <2><589>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <58a>   DW_AT_type        : <0x2a>
 <2><58e>: Abbrev Number: 0
 <1><58f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <590>   DW_AT_byte_size   : 4
    <590>   DW_AT_type        : <0x599>
 <1><594>: Abbrev Number: 41 (DW_TAG_restrict_type)
    <595>   DW_AT_type        : <0x58f>
 <1><599>: Abbrev Number: 17 (DW_TAG_base_type)
    <59a>   DW_AT_byte_size   : 1
    <59b>   DW_AT_encoding    : 8	(unsigned char)
    <59c>   DW_AT_name        : (indirect string, offset: 0x541b2): char
 <1><5a0>: Abbrev Number: 15 (DW_TAG_const_type)
    <5a1>   DW_AT_type        : <0x599>
 <1><5a5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5a6>   DW_AT_byte_size   : 4
    <5a6>   DW_AT_type        : <0x571>
 <1><5aa>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <5ab>   DW_AT_prototyped  : 1
    <5ab>   DW_AT_type        : <0x2a>
    <5af>   DW_AT_sibling     : <0x5c8>
 <2><5b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <5b4>   DW_AT_type        : <0x56c>
 <2><5b8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <5b9>   DW_AT_type        : <0xfb>
 <2><5bd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <5be>   DW_AT_type        : <0x5c8>
 <2><5c2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <5c3>   DW_AT_type        : <0x2a>
 <2><5c7>: Abbrev Number: 0
 <1><5c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5c9>   DW_AT_byte_size   : 4
    <5c9>   DW_AT_type        : <0x5a0>
 <1><5cd>: Abbrev Number: 15 (DW_TAG_const_type)
    <5ce>   DW_AT_type        : <0x5c8>
 <1><5d2>: Abbrev Number: 41 (DW_TAG_restrict_type)
    <5d3>   DW_AT_type        : <0x5c8>
 <1><5d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5d8>   DW_AT_byte_size   : 4
    <5d8>   DW_AT_type        : <0x5aa>
 <1><5dc>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <5dd>   DW_AT_prototyped  : 1
    <5dd>   DW_AT_type        : <0x15a>
    <5e1>   DW_AT_sibling     : <0x5fa>
 <2><5e5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <5e6>   DW_AT_type        : <0x56c>
 <2><5ea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <5eb>   DW_AT_type        : <0xfb>
 <2><5ef>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <5f0>   DW_AT_type        : <0x15a>
 <2><5f4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <5f5>   DW_AT_type        : <0x2a>
 <2><5f9>: Abbrev Number: 0
 <1><5fa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5fb>   DW_AT_byte_size   : 4
    <5fb>   DW_AT_type        : <0x5dc>
 <1><5ff>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <600>   DW_AT_prototyped  : 1
    <600>   DW_AT_type        : <0x2a>
    <604>   DW_AT_sibling     : <0x613>
 <2><608>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <609>   DW_AT_type        : <0x56c>
 <2><60d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <60e>   DW_AT_type        : <0xfb>
 <2><612>: Abbrev Number: 0
 <1><613>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <614>   DW_AT_byte_size   : 4
    <614>   DW_AT_type        : <0x5ff>
 <1><618>: Abbrev Number: 10 (DW_TAG_array_type)
    <619>   DW_AT_type        : <0x65>
    <61d>   DW_AT_sibling     : <0x628>
 <2><621>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <622>   DW_AT_type        : <0x3d>
    <626>   DW_AT_upper_bound : 2
 <2><627>: Abbrev Number: 0
 <1><628>: Abbrev Number: 10 (DW_TAG_array_type)
    <629>   DW_AT_type        : <0x65>
    <62d>   DW_AT_sibling     : <0x638>
 <2><631>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <632>   DW_AT_type        : <0x3d>
    <636>   DW_AT_upper_bound : 0
 <2><637>: Abbrev Number: 0
 <1><638>: Abbrev Number: 36 (DW_TAG_typedef)
    <639>   DW_AT_name        : (indirect string, offset: 0xcc2ba): __FILE
    <63d>   DW_AT_decl_file   : 10
    <63e>   DW_AT_decl_line   : 270
    <640>   DW_AT_decl_column : 26
    <641>   DW_AT_type        : <0x313>
 <1><645>: Abbrev Number: 10 (DW_TAG_array_type)
    <646>   DW_AT_type        : <0x638>
    <64a>   DW_AT_sibling     : <0x655>
 <2><64e>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <64f>   DW_AT_type        : <0x3d>
    <653>   DW_AT_upper_bound : 2
 <2><654>: Abbrev Number: 0
 <1><655>: Abbrev Number: 42 (DW_TAG_variable)
    <656>   DW_AT_name        : (indirect string, offset: 0x45ddc): __sf
    <65a>   DW_AT_decl_file   : 10
    <65a>   DW_AT_decl_line   : 274
    <65c>   DW_AT_decl_column : 15
    <65d>   DW_AT_type        : <0x645>
    <661>   DW_AT_external    : 1
    <661>   DW_AT_declaration : 1
 <1><661>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <662>   DW_AT_byte_size   : 4
    <662>   DW_AT_type        : <0x638>
 <1><666>: Abbrev Number: 31 (DW_TAG_structure_type)
    <667>   DW_AT_name        : (indirect string, offset: 0x5a2f5): _rand48
    <66b>   DW_AT_byte_size   : 24
    <66c>   DW_AT_decl_file   : 10
    <66c>   DW_AT_decl_line   : 306
    <66e>   DW_AT_decl_column : 8
    <66e>   DW_AT_sibling     : <0x6ab>
 <2><672>: Abbrev Number: 4 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0xf9375): _seed
    <677>   DW_AT_decl_file   : 10
    <678>   DW_AT_decl_line   : 307
    <67a>   DW_AT_decl_column : 18
    <67b>   DW_AT_type        : <0x6ab>
    <67f>   DW_AT_data_member_location: 0
 <2><680>: Abbrev Number: 4 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0x152cb): _mult
    <685>   DW_AT_decl_file   : 10
    <686>   DW_AT_decl_line   : 308
    <688>   DW_AT_decl_column : 18
    <689>   DW_AT_type        : <0x6ab>
    <68d>   DW_AT_data_member_location: 6
 <2><68e>: Abbrev Number: 4 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0x84075): _add
    <693>   DW_AT_decl_file   : 10
    <694>   DW_AT_decl_line   : 309
    <696>   DW_AT_decl_column : 18
    <697>   DW_AT_type        : <0x73>
    <69b>   DW_AT_data_member_location: 12
 <2><69c>: Abbrev Number: 4 (DW_TAG_member)
    <69d>   DW_AT_name        : (indirect string, offset: 0x97e74): _rand_next
    <6a1>   DW_AT_decl_file   : 10
    <6a2>   DW_AT_decl_line   : 312
    <6a4>   DW_AT_decl_column : 36
    <6a5>   DW_AT_type        : <0xa0>
    <6a9>   DW_AT_data_member_location: 16
 <2><6aa>: Abbrev Number: 0
 <1><6ab>: Abbrev Number: 10 (DW_TAG_array_type)
    <6ac>   DW_AT_type        : <0x73>
    <6b0>   DW_AT_sibling     : <0x6bb>
 <2><6b4>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <6b5>   DW_AT_type        : <0x3d>
    <6b9>   DW_AT_upper_bound : 2
 <2><6ba>: Abbrev Number: 0
 <1><6bb>: Abbrev Number: 31 (DW_TAG_structure_type)
    <6bc>   DW_AT_name        : (indirect string, offset: 0xc20a3): _mprec
    <6c0>   DW_AT_byte_size   : 16
    <6c1>   DW_AT_decl_file   : 10
    <6c1>   DW_AT_decl_line   : 348
    <6c3>   DW_AT_decl_column : 8
    <6c3>   DW_AT_sibling     : <0x700>
 <2><6c7>: Abbrev Number: 4 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0xfd2d0): _result
    <6cc>   DW_AT_decl_file   : 10
    <6cd>   DW_AT_decl_line   : 351
    <6cf>   DW_AT_decl_column : 19
    <6d0>   DW_AT_type        : <0x24e>
    <6d4>   DW_AT_data_member_location: 0
 <2><6d5>: Abbrev Number: 4 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x9f3f5): _result_k
    <6da>   DW_AT_decl_file   : 10
    <6db>   DW_AT_decl_line   : 352
    <6dd>   DW_AT_decl_column : 7
    <6de>   DW_AT_type        : <0x2a>
    <6e2>   DW_AT_data_member_location: 4
 <2><6e3>: Abbrev Number: 4 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x7a6f7): _p5s
    <6e8>   DW_AT_decl_file   : 10
    <6e9>   DW_AT_decl_line   : 353
    <6eb>   DW_AT_decl_column : 19
    <6ec>   DW_AT_type        : <0x24e>
    <6f0>   DW_AT_data_member_location: 8
 <2><6f1>: Abbrev Number: 4 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0xb2e30): _freelist
    <6f6>   DW_AT_decl_file   : 10
    <6f7>   DW_AT_decl_line   : 354
    <6f9>   DW_AT_decl_column : 20
    <6fa>   DW_AT_type        : <0x700>
    <6fe>   DW_AT_data_member_location: 12
 <2><6ff>: Abbrev Number: 0
 <1><700>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <701>   DW_AT_byte_size   : 4
    <701>   DW_AT_type        : <0x24e>
 <1><705>: Abbrev Number: 31 (DW_TAG_structure_type)
    <706>   DW_AT_name        : (indirect string, offset: 0x7a6a8): _misc_reent
    <70a>   DW_AT_byte_size   : 80
    <70b>   DW_AT_decl_file   : 10
    <70b>   DW_AT_decl_line   : 358
    <70d>   DW_AT_decl_column : 8
    <70d>   DW_AT_sibling     : <0x7ac>
 <2><711>: Abbrev Number: 4 (DW_TAG_member)
    <712>   DW_AT_name        : (indirect string, offset: 0xe8398): _strtok_last
    <716>   DW_AT_decl_file   : 10
    <717>   DW_AT_decl_line   : 361
    <719>   DW_AT_decl_column : 9
    <71a>   DW_AT_type        : <0x58f>
    <71e>   DW_AT_data_member_location: 0
 <2><71f>: Abbrev Number: 4 (DW_TAG_member)
    <720>   DW_AT_name        : (indirect string, offset: 0x70a1e): _mblen_state
    <724>   DW_AT_decl_file   : 10
    <725>   DW_AT_decl_line   : 362
    <727>   DW_AT_decl_column : 14
    <728>   DW_AT_type        : <0x1ba>
    <72c>   DW_AT_data_member_location: 4
 <2><72d>: Abbrev Number: 4 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0xbcfd0): _wctomb_state
    <732>   DW_AT_decl_file   : 10
    <733>   DW_AT_decl_line   : 363
    <735>   DW_AT_decl_column : 14
    <736>   DW_AT_type        : <0x1ba>
    <73a>   DW_AT_data_member_location: 12
 <2><73b>: Abbrev Number: 4 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0x79bd6): _mbtowc_state
    <740>   DW_AT_decl_file   : 10
    <741>   DW_AT_decl_line   : 364
    <743>   DW_AT_decl_column : 14
    <744>   DW_AT_type        : <0x1ba>
    <748>   DW_AT_data_member_location: 20
 <2><749>: Abbrev Number: 4 (DW_TAG_member)
    <74a>   DW_AT_name        : (indirect string, offset: 0x40970): _l64a_buf
    <74e>   DW_AT_decl_file   : 10
    <74f>   DW_AT_decl_line   : 365
    <751>   DW_AT_decl_column : 8
    <752>   DW_AT_type        : <0x7ac>
    <756>   DW_AT_data_member_location: 28
 <2><757>: Abbrev Number: 4 (DW_TAG_member)
    <758>   DW_AT_name        : (indirect string, offset: 0xe67b4): _getdate_err
    <75c>   DW_AT_decl_file   : 10
    <75d>   DW_AT_decl_line   : 366
    <75f>   DW_AT_decl_column : 7
    <760>   DW_AT_type        : <0x2a>
    <764>   DW_AT_data_member_location: 36
 <2><765>: Abbrev Number: 4 (DW_TAG_member)
    <766>   DW_AT_name        : (indirect string, offset: 0x7c3df): _mbrlen_state
    <76a>   DW_AT_decl_file   : 10
    <76b>   DW_AT_decl_line   : 367
    <76d>   DW_AT_decl_column : 14
    <76e>   DW_AT_type        : <0x1ba>
    <772>   DW_AT_data_member_location: 40
 <2><773>: Abbrev Number: 4 (DW_TAG_member)
    <774>   DW_AT_name        : (indirect string, offset: 0xe6dcd): _mbrtowc_state
    <778>   DW_AT_decl_file   : 10
    <779>   DW_AT_decl_line   : 368
    <77b>   DW_AT_decl_column : 14
    <77c>   DW_AT_type        : <0x1ba>
    <780>   DW_AT_data_member_location: 48
 <2><781>: Abbrev Number: 4 (DW_TAG_member)
    <782>   DW_AT_name        : (indirect string, offset: 0x48cef): _mbsrtowcs_state
    <786>   DW_AT_decl_file   : 10
    <787>   DW_AT_decl_line   : 369
    <789>   DW_AT_decl_column : 14
    <78a>   DW_AT_type        : <0x1ba>
    <78e>   DW_AT_data_member_location: 56
 <2><78f>: Abbrev Number: 4 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0x50ac3): _wcrtomb_state
    <794>   DW_AT_decl_file   : 10
    <795>   DW_AT_decl_line   : 370
    <797>   DW_AT_decl_column : 14
    <798>   DW_AT_type        : <0x1ba>
    <79c>   DW_AT_data_member_location: 64
 <2><79d>: Abbrev Number: 4 (DW_TAG_member)
    <79e>   DW_AT_name        : (indirect string, offset: 0x91351): _wcsrtombs_state
    <7a2>   DW_AT_decl_file   : 10
    <7a3>   DW_AT_decl_line   : 371
    <7a5>   DW_AT_decl_column : 14
    <7a6>   DW_AT_type        : <0x1ba>
    <7aa>   DW_AT_data_member_location: 72
 <2><7ab>: Abbrev Number: 0
 <1><7ac>: Abbrev Number: 10 (DW_TAG_array_type)
    <7ad>   DW_AT_type        : <0x599>
    <7b1>   DW_AT_sibling     : <0x7bc>
 <2><7b5>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <7b6>   DW_AT_type        : <0x3d>
    <7ba>   DW_AT_upper_bound : 7
 <2><7bb>: Abbrev Number: 0
 <1><7bc>: Abbrev Number: 30 (DW_TAG_structure_type)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xda27b): __locale_t
    <7c1>   DW_AT_declaration : 1
 <1><7c1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7c2>   DW_AT_byte_size   : 4
    <7c2>   DW_AT_type        : <0x7bc>
 <1><7c6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7c7>   DW_AT_byte_size   : 4
    <7c7>   DW_AT_type        : <0x6bb>
 <1><7cb>: Abbrev Number: 35 (DW_TAG_subroutine_type)
    <7cc>   DW_AT_prototyped  : 1
    <7cc>   DW_AT_sibling     : <0x7d6>
 <2><7d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7d1>   DW_AT_type        : <0x56c>
 <2><7d5>: Abbrev Number: 0
 <1><7d6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7d7>   DW_AT_byte_size   : 4
    <7d7>   DW_AT_type        : <0x7cb>
 <1><7db>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7dc>   DW_AT_byte_size   : 4
    <7dc>   DW_AT_type        : <0x666>
 <1><7e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7e1>   DW_AT_byte_size   : 4
    <7e1>   DW_AT_type        : <0x263>
 <1><7e5>: Abbrev Number: 35 (DW_TAG_subroutine_type)
    <7e6>   DW_AT_prototyped  : 1
    <7e6>   DW_AT_sibling     : <0x7f0>
 <2><7ea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <7eb>   DW_AT_type        : <0x2a>
 <2><7ef>: Abbrev Number: 0
 <1><7f0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7f1>   DW_AT_byte_size   : 4
    <7f1>   DW_AT_type        : <0x7f5>
 <1><7f5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7f6>   DW_AT_byte_size   : 4
    <7f6>   DW_AT_type        : <0x7e5>
 <1><7fa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <7fb>   DW_AT_byte_size   : 4
    <7fb>   DW_AT_type        : <0x705>
 <1><7ff>: Abbrev Number: 42 (DW_TAG_variable)
    <800>   DW_AT_name        : (indirect string, offset: 0x3ce5a): _impure_ptr
    <804>   DW_AT_decl_file   : 10
    <804>   DW_AT_decl_line   : 797
    <806>   DW_AT_decl_column : 23
    <807>   DW_AT_type        : <0x56c>
    <80b>   DW_AT_external    : 1
    <80b>   DW_AT_declaration : 1
 <1><80b>: Abbrev Number: 10 (DW_TAG_array_type)
    <80c>   DW_AT_type        : <0xbd>
    <810>   DW_AT_sibling     : <0x81b>
 <2><814>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <815>   DW_AT_type        : <0x3d>
    <819>   DW_AT_upper_bound : 0
 <2><81a>: Abbrev Number: 0
 <1><81b>: Abbrev Number: 8 (DW_TAG_typedef)
    <81c>   DW_AT_name        : (indirect string, offset: 0xdcf5a): TaskHandle_t
    <820>   DW_AT_decl_file   : 12
    <821>   DW_AT_decl_line   : 92
    <822>   DW_AT_decl_column : 46
    <823>   DW_AT_type        : <0x827>
 <1><827>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <828>   DW_AT_byte_size   : 4
    <828>   DW_AT_type        : <0x82c>
 <1><82c>: Abbrev Number: 30 (DW_TAG_structure_type)
    <82d>   DW_AT_name        : (indirect string, offset: 0xd87ab): tskTaskControlBlock
    <831>   DW_AT_declaration : 1
 <1><831>: Abbrev Number: 33 (DW_TAG_enumeration_type)
    <832>   DW_AT_encoding    : 7	(unsigned)
    <832>   DW_AT_byte_size   : 1
    <833>   DW_AT_type        : <0x65>
    <837>   DW_AT_decl_file   : 12
    <838>   DW_AT_decl_line   : 103
    <839>   DW_AT_decl_column : 1
    <839>   DW_AT_sibling     : <0x862>
 <2><83d>: Abbrev Number: 6 (DW_TAG_enumerator)
    <83e>   DW_AT_name        : (indirect string, offset: 0x27bd2): eRunning
    <842>   DW_AT_const_value : 0
 <2><843>: Abbrev Number: 6 (DW_TAG_enumerator)
    <844>   DW_AT_name        : (indirect string, offset: 0x64db2): eReady
    <848>   DW_AT_const_value : 1
 <2><849>: Abbrev Number: 6 (DW_TAG_enumerator)
    <84a>   DW_AT_name        : (indirect string, offset: 0x71b66): eBlocked
    <84e>   DW_AT_const_value : 2
 <2><84f>: Abbrev Number: 6 (DW_TAG_enumerator)
    <850>   DW_AT_name        : (indirect string, offset: 0x94b36): eSuspended
    <854>   DW_AT_const_value : 3
 <2><855>: Abbrev Number: 6 (DW_TAG_enumerator)
    <856>   DW_AT_name        : (indirect string, offset: 0xbcb9e): eDeleted
    <85a>   DW_AT_const_value : 4
 <2><85b>: Abbrev Number: 6 (DW_TAG_enumerator)
    <85c>   DW_AT_name        : (indirect string, offset: 0x29a09): eInvalid
    <860>   DW_AT_const_value : 5
 <2><861>: Abbrev Number: 0
 <1><862>: Abbrev Number: 8 (DW_TAG_typedef)
    <863>   DW_AT_name        : (indirect string, offset: 0x580b): eTaskState
    <867>   DW_AT_decl_file   : 12
    <868>   DW_AT_decl_line   : 110
    <869>   DW_AT_decl_column : 3
    <86a>   DW_AT_type        : <0x831>
 <1><86e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <86f>   DW_AT_byte_size   : 4
    <86f>   DW_AT_type        : <0x102>
 <1><873>: Abbrev Number: 23 (DW_TAG_structure_type)
    <874>   DW_AT_name        : (indirect string, offset: 0xf1a4c): xTASK_STATUS
    <878>   DW_AT_byte_size   : 44
    <879>   DW_AT_decl_file   : 12
    <87a>   DW_AT_decl_line   : 160
    <87b>   DW_AT_decl_column : 16
    <87c>   DW_AT_sibling     : <0x910>
 <2><880>: Abbrev Number: 3 (DW_TAG_member)
    <881>   DW_AT_name        : (indirect string, offset: 0x10a278): xHandle
    <885>   DW_AT_decl_file   : 12
    <886>   DW_AT_decl_line   : 162
    <887>   DW_AT_decl_column : 18
    <888>   DW_AT_type        : <0x81b>
    <88c>   DW_AT_data_member_location: 0
 <2><88d>: Abbrev Number: 3 (DW_TAG_member)
    <88e>   DW_AT_name        : (indirect string, offset: 0x58f8f): pcTaskName
    <892>   DW_AT_decl_file   : 12
    <893>   DW_AT_decl_line   : 163
    <894>   DW_AT_decl_column : 18
    <895>   DW_AT_type        : <0x5c8>
    <899>   DW_AT_data_member_location: 4
 <2><89a>: Abbrev Number: 3 (DW_TAG_member)
    <89b>   DW_AT_name        : (indirect string, offset: 0x109c2b): xTaskNumber
    <89f>   DW_AT_decl_file   : 12
    <8a0>   DW_AT_decl_line   : 164
    <8a1>   DW_AT_decl_column : 17
    <8a2>   DW_AT_type        : <0x11f>
    <8a6>   DW_AT_data_member_location: 8
 <2><8a7>: Abbrev Number: 3 (DW_TAG_member)
    <8a8>   DW_AT_name        : (indirect string, offset: 0x263f): eCurrentState
    <8ac>   DW_AT_decl_file   : 12
    <8ad>   DW_AT_decl_line   : 165
    <8ae>   DW_AT_decl_column : 16
    <8af>   DW_AT_type        : <0x862>
    <8b3>   DW_AT_data_member_location: 12
 <2><8b4>: Abbrev Number: 3 (DW_TAG_member)
    <8b5>   DW_AT_name        : (indirect string, offset: 0xbebd): uxCurrentPriority
    <8b9>   DW_AT_decl_file   : 12
    <8ba>   DW_AT_decl_line   : 166
    <8bb>   DW_AT_decl_column : 17
    <8bc>   DW_AT_type        : <0x11f>
    <8c0>   DW_AT_data_member_location: 16
 <2><8c1>: Abbrev Number: 3 (DW_TAG_member)
    <8c2>   DW_AT_name        : (indirect string, offset: 0x9e1cd): uxBasePriority
    <8c6>   DW_AT_decl_file   : 12
    <8c7>   DW_AT_decl_line   : 167
    <8c8>   DW_AT_decl_column : 17
    <8c9>   DW_AT_type        : <0x11f>
    <8cd>   DW_AT_data_member_location: 20
 <2><8ce>: Abbrev Number: 3 (DW_TAG_member)
    <8cf>   DW_AT_name        : (indirect string, offset: 0xab99c): ulRunTimeCounter
    <8d3>   DW_AT_decl_file   : 12
    <8d4>   DW_AT_decl_line   : 168
    <8d5>   DW_AT_decl_column : 33
    <8d6>   DW_AT_type        : <0xbd>
    <8da>   DW_AT_data_member_location: 24
 <2><8db>: Abbrev Number: 3 (DW_TAG_member)
    <8dc>   DW_AT_name        : (indirect string, offset: 0x7c714): pxStackBase
    <8e0>   DW_AT_decl_file   : 12
    <8e1>   DW_AT_decl_line   : 169
    <8e2>   DW_AT_decl_column : 19
    <8e3>   DW_AT_type        : <0x86e>
    <8e7>   DW_AT_data_member_location: 28
 <2><8e8>: Abbrev Number: 3 (DW_TAG_member)
    <8e9>   DW_AT_name        : (indirect string, offset: 0xcea49): pxTopOfStack
    <8ed>   DW_AT_decl_file   : 12
    <8ee>   DW_AT_decl_line   : 171
    <8ef>   DW_AT_decl_column : 23
    <8f0>   DW_AT_type        : <0x86e>
    <8f4>   DW_AT_data_member_location: 32
 <2><8f5>: Abbrev Number: 3 (DW_TAG_member)
    <8f6>   DW_AT_name        : (indirect string, offset: 0xa32f2): pxEndOfStack
    <8fa>   DW_AT_decl_file   : 12
    <8fb>   DW_AT_decl_line   : 172
    <8fc>   DW_AT_decl_column : 23
    <8fd>   DW_AT_type        : <0x86e>
    <901>   DW_AT_data_member_location: 36
 <2><902>: Abbrev Number: 3 (DW_TAG_member)
    <903>   DW_AT_name        : (indirect string, offset: 0x761e0): usStackHighWaterMark
    <907>   DW_AT_decl_file   : 12
    <908>   DW_AT_decl_line   : 174
    <909>   DW_AT_decl_column : 28
    <90a>   DW_AT_type        : <0x102>
    <90e>   DW_AT_data_member_location: 40
 <2><90f>: Abbrev Number: 0
 <1><910>: Abbrev Number: 8 (DW_TAG_typedef)
    <911>   DW_AT_name        : (indirect string, offset: 0x24c73): TaskStatus_t
    <915>   DW_AT_decl_file   : 12
    <916>   DW_AT_decl_line   : 178
    <917>   DW_AT_decl_column : 3
    <918>   DW_AT_type        : <0x873>
 <1><91c>: Abbrev Number: 8 (DW_TAG_typedef)
    <91d>   DW_AT_name        : (indirect string, offset: 0x5d185): QueueHandle_t
    <921>   DW_AT_decl_file   : 13
    <922>   DW_AT_decl_line   : 51
    <923>   DW_AT_decl_column : 36
    <924>   DW_AT_type        : <0x928>
 <1><928>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <929>   DW_AT_byte_size   : 4
    <929>   DW_AT_type        : <0x92d>
 <1><92d>: Abbrev Number: 30 (DW_TAG_structure_type)
    <92e>   DW_AT_name        : (indirect string, offset: 0xaa41f): QueueDefinition
    <932>   DW_AT_declaration : 1
 <1><932>: Abbrev Number: 8 (DW_TAG_typedef)
    <933>   DW_AT_name        : (indirect string, offset: 0x5ffdc): SemaphoreHandle_t
    <937>   DW_AT_decl_file   : 14
    <938>   DW_AT_decl_line   : 38
    <939>   DW_AT_decl_column : 23
    <93a>   DW_AT_type        : <0x91c>
 <1><93e>: Abbrev Number: 8 (DW_TAG_typedef)
    <93f>   DW_AT_name        : (indirect string, offset: 0xd37c2): FILE
    <943>   DW_AT_decl_file   : 15
    <944>   DW_AT_decl_line   : 66
    <945>   DW_AT_decl_column : 16
    <946>   DW_AT_type        : <0x638>
 <1><94a>: Abbrev Number: 8 (DW_TAG_typedef)
    <94b>   DW_AT_name        : (indirect string, offset: 0x396f5): fpos_t
    <94f>   DW_AT_decl_file   : 15
    <950>   DW_AT_decl_line   : 70
    <951>   DW_AT_decl_column : 17
    <952>   DW_AT_type        : <0x15a>
 <1><956>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <957>   DW_AT_byte_size   : 4
    <957>   DW_AT_type        : <0x95b>
 <1><95b>: Abbrev Number: 52 (DW_TAG_const_type)
 <1><95c>: Abbrev Number: 23 (DW_TAG_structure_type)
    <95d>   DW_AT_name        : (indirect string, offset: 0xbbc62): mallinfo
    <961>   DW_AT_byte_size   : 40
    <962>   DW_AT_decl_file   : 16
    <963>   DW_AT_decl_line   : 22
    <964>   DW_AT_decl_column : 8
    <965>   DW_AT_sibling     : <0x9ec>
 <2><969>: Abbrev Number: 3 (DW_TAG_member)
    <96a>   DW_AT_name        : (indirect string, offset: 0x74f04): arena
    <96e>   DW_AT_decl_file   : 16
    <96f>   DW_AT_decl_line   : 23
    <970>   DW_AT_decl_column : 10
    <971>   DW_AT_type        : <0x31>
    <975>   DW_AT_data_member_location: 0
 <2><976>: Abbrev Number: 3 (DW_TAG_member)
    <977>   DW_AT_name        : (indirect string, offset: 0x3a51e): ordblks
    <97b>   DW_AT_decl_file   : 16
    <97c>   DW_AT_decl_line   : 24
    <97d>   DW_AT_decl_column : 10
    <97e>   DW_AT_type        : <0x31>
    <982>   DW_AT_data_member_location: 4
 <2><983>: Abbrev Number: 3 (DW_TAG_member)
    <984>   DW_AT_name        : (indirect string, offset: 0x970e8): smblks
    <988>   DW_AT_decl_file   : 16
    <989>   DW_AT_decl_line   : 25
    <98a>   DW_AT_decl_column : 10
    <98b>   DW_AT_type        : <0x31>
    <98f>   DW_AT_data_member_location: 8
 <2><990>: Abbrev Number: 3 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0xb51cf): hblks
    <995>   DW_AT_decl_file   : 16
    <996>   DW_AT_decl_line   : 26
    <997>   DW_AT_decl_column : 10
    <998>   DW_AT_type        : <0x31>
    <99c>   DW_AT_data_member_location: 12
 <2><99d>: Abbrev Number: 3 (DW_TAG_member)
    <99e>   DW_AT_name        : (indirect string, offset: 0x7ec7b): hblkhd
    <9a2>   DW_AT_decl_file   : 16
    <9a3>   DW_AT_decl_line   : 27
    <9a4>   DW_AT_decl_column : 10
    <9a5>   DW_AT_type        : <0x31>
    <9a9>   DW_AT_data_member_location: 16
 <2><9aa>: Abbrev Number: 3 (DW_TAG_member)
    <9ab>   DW_AT_name        : (indirect string, offset: 0xd8bec): usmblks
    <9af>   DW_AT_decl_file   : 16
    <9b0>   DW_AT_decl_line   : 28
    <9b1>   DW_AT_decl_column : 10
    <9b2>   DW_AT_type        : <0x31>
    <9b6>   DW_AT_data_member_location: 20
 <2><9b7>: Abbrev Number: 3 (DW_TAG_member)
    <9b8>   DW_AT_name        : (indirect string, offset: 0x970e7): fsmblks
    <9bc>   DW_AT_decl_file   : 16
    <9bd>   DW_AT_decl_line   : 29
    <9be>   DW_AT_decl_column : 10
    <9bf>   DW_AT_type        : <0x31>
    <9c3>   DW_AT_data_member_location: 24
 <2><9c4>: Abbrev Number: 3 (DW_TAG_member)
    <9c5>   DW_AT_name        : (indirect string, offset: 0xf004d): uordblks
    <9c9>   DW_AT_decl_file   : 16
    <9ca>   DW_AT_decl_line   : 30
    <9cb>   DW_AT_decl_column : 10
    <9cc>   DW_AT_type        : <0x31>
    <9d0>   DW_AT_data_member_location: 28
 <2><9d1>: Abbrev Number: 3 (DW_TAG_member)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x3a51d): fordblks
    <9d6>   DW_AT_decl_file   : 16
    <9d7>   DW_AT_decl_line   : 31
    <9d8>   DW_AT_decl_column : 10
    <9d9>   DW_AT_type        : <0x31>
    <9dd>   DW_AT_data_member_location: 32
 <2><9de>: Abbrev Number: 3 (DW_TAG_member)
    <9df>   DW_AT_name        : (indirect string, offset: 0x8cff7): keepcost
    <9e3>   DW_AT_decl_file   : 16
    <9e4>   DW_AT_decl_line   : 32
    <9e5>   DW_AT_decl_column : 10
    <9e6>   DW_AT_type        : <0x31>
    <9ea>   DW_AT_data_member_location: 36
 <2><9eb>: Abbrev Number: 0
 <1><9ec>: Abbrev Number: 17 (DW_TAG_base_type)
    <9ed>   DW_AT_byte_size   : 4
    <9ee>   DW_AT_encoding    : 4	(float)
    <9ef>   DW_AT_name        : (indirect string, offset: 0xe5da0): float
 <1><9f3>: Abbrev Number: 17 (DW_TAG_base_type)
    <9f4>   DW_AT_byte_size   : 8
    <9f5>   DW_AT_encoding    : 4	(float)
    <9f6>   DW_AT_name        : (indirect string, offset: 0x1ffd9): double
 <1><9fa>: Abbrev Number: 53 (DW_TAG_structure_type)
    <9fb>   DW_AT_byte_size   : 684
    <9fd>   DW_AT_decl_file   : 2
    <9fe>   DW_AT_decl_line   : 455
    <a00>   DW_AT_decl_column : 9
    <a01>   DW_AT_sibling     : <0xca7>
 <2><a05>: Abbrev Number: 4 (DW_TAG_member)
    <a06>   DW_AT_name        : (indirect string, offset: 0x54e64): CPUID
    <a0a>   DW_AT_decl_file   : 2
    <a0b>   DW_AT_decl_line   : 457
    <a0d>   DW_AT_decl_column : 18
    <a0e>   DW_AT_type        : <0xce>
    <a12>   DW_AT_data_member_location: 0
 <2><a13>: Abbrev Number: 4 (DW_TAG_member)
    <a14>   DW_AT_name        : (indirect string, offset: 0x53c9e): ICSR
    <a18>   DW_AT_decl_file   : 2
    <a19>   DW_AT_decl_line   : 458
    <a1b>   DW_AT_decl_column : 18
    <a1c>   DW_AT_type        : <0xc9>
    <a20>   DW_AT_data_member_location: 4
 <2><a21>: Abbrev Number: 4 (DW_TAG_member)
    <a22>   DW_AT_name        : (indirect string, offset: 0x8be6): VTOR
    <a26>   DW_AT_decl_file   : 2
    <a27>   DW_AT_decl_line   : 459
    <a29>   DW_AT_decl_column : 18
    <a2a>   DW_AT_type        : <0xc9>
    <a2e>   DW_AT_data_member_location: 8
 <2><a2f>: Abbrev Number: 4 (DW_TAG_member)
    <a30>   DW_AT_name        : (indirect string, offset: 0x4c24a): AIRCR
    <a34>   DW_AT_decl_file   : 2
    <a35>   DW_AT_decl_line   : 460
    <a37>   DW_AT_decl_column : 18
    <a38>   DW_AT_type        : <0xc9>
    <a3c>   DW_AT_data_member_location: 12
 <2><a3d>: Abbrev Number: 32 (DW_TAG_member)
    <a3e>   DW_AT_name        : SCR
    <a42>   DW_AT_decl_file   : 2
    <a43>   DW_AT_decl_line   : 461
    <a45>   DW_AT_decl_column : 18
    <a45>   DW_AT_type        : <0xc9>
    <a49>   DW_AT_data_member_location: 16
 <2><a4a>: Abbrev Number: 32 (DW_TAG_member)
    <a4b>   DW_AT_name        : CCR
    <a4f>   DW_AT_decl_file   : 2
    <a50>   DW_AT_decl_line   : 462
    <a52>   DW_AT_decl_column : 18
    <a52>   DW_AT_type        : <0xc9>
    <a56>   DW_AT_data_member_location: 20
 <2><a57>: Abbrev Number: 4 (DW_TAG_member)
    <a58>   DW_AT_name        : (indirect string, offset: 0xd5f15): SHPR
    <a5c>   DW_AT_decl_file   : 2
    <a5d>   DW_AT_decl_line   : 463
    <a5f>   DW_AT_decl_column : 18
    <a60>   DW_AT_type        : <0xcb7>
    <a64>   DW_AT_data_member_location: 24
 <2><a65>: Abbrev Number: 4 (DW_TAG_member)
    <a66>   DW_AT_name        : (indirect string, offset: 0x8861c): SHCSR
    <a6a>   DW_AT_decl_file   : 2
    <a6b>   DW_AT_decl_line   : 464
    <a6d>   DW_AT_decl_column : 18
    <a6e>   DW_AT_type        : <0xc9>
    <a72>   DW_AT_data_member_location: 36
 <2><a73>: Abbrev Number: 4 (DW_TAG_member)
    <a74>   DW_AT_name        : (indirect string, offset: 0xa16b3): CFSR
    <a78>   DW_AT_decl_file   : 2
    <a79>   DW_AT_decl_line   : 465
    <a7b>   DW_AT_decl_column : 18
    <a7c>   DW_AT_type        : <0xc9>
    <a80>   DW_AT_data_member_location: 40
 <2><a81>: Abbrev Number: 4 (DW_TAG_member)
    <a82>   DW_AT_name        : (indirect string, offset: 0x8ce63): HFSR
    <a86>   DW_AT_decl_file   : 2
    <a87>   DW_AT_decl_line   : 466
    <a89>   DW_AT_decl_column : 18
    <a8a>   DW_AT_type        : <0xc9>
    <a8e>   DW_AT_data_member_location: 44
 <2><a8f>: Abbrev Number: 4 (DW_TAG_member)
    <a90>   DW_AT_name        : (indirect string, offset: 0xcfa92): DFSR
    <a94>   DW_AT_decl_file   : 2
    <a95>   DW_AT_decl_line   : 467
    <a97>   DW_AT_decl_column : 18
    <a98>   DW_AT_type        : <0xc9>
    <a9c>   DW_AT_data_member_location: 48
 <2><a9d>: Abbrev Number: 4 (DW_TAG_member)
    <a9e>   DW_AT_name        : (indirect string, offset: 0xe67ae): MMFAR
    <aa2>   DW_AT_decl_file   : 2
    <aa3>   DW_AT_decl_line   : 468
    <aa5>   DW_AT_decl_column : 18
    <aa6>   DW_AT_type        : <0xc9>
    <aaa>   DW_AT_data_member_location: 52
 <2><aab>: Abbrev Number: 4 (DW_TAG_member)
    <aac>   DW_AT_name        : (indirect string, offset: 0x69972): BFAR
    <ab0>   DW_AT_decl_file   : 2
    <ab1>   DW_AT_decl_line   : 469
    <ab3>   DW_AT_decl_column : 18
    <ab4>   DW_AT_type        : <0xc9>
    <ab8>   DW_AT_data_member_location: 56
 <2><ab9>: Abbrev Number: 4 (DW_TAG_member)
    <aba>   DW_AT_name        : (indirect string, offset: 0xfc9c7): AFSR
    <abe>   DW_AT_decl_file   : 2
    <abf>   DW_AT_decl_line   : 470
    <ac1>   DW_AT_decl_column : 18
    <ac2>   DW_AT_type        : <0xc9>
    <ac6>   DW_AT_data_member_location: 60
 <2><ac7>: Abbrev Number: 4 (DW_TAG_member)
    <ac8>   DW_AT_name        : (indirect string, offset: 0x20bd8): ID_PFR
    <acc>   DW_AT_decl_file   : 2
    <acd>   DW_AT_decl_line   : 471
    <acf>   DW_AT_decl_column : 18
    <ad0>   DW_AT_type        : <0xcd1>
    <ad4>   DW_AT_data_member_location: 64
 <2><ad5>: Abbrev Number: 4 (DW_TAG_member)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x7c083): ID_DFR
    <ada>   DW_AT_decl_file   : 2
    <adb>   DW_AT_decl_line   : 472
    <add>   DW_AT_decl_column : 18
    <ade>   DW_AT_type        : <0xce>
    <ae2>   DW_AT_data_member_location: 72
 <2><ae3>: Abbrev Number: 4 (DW_TAG_member)
    <ae4>   DW_AT_name        : (indirect string, offset: 0x11878): ID_AFR
    <ae8>   DW_AT_decl_file   : 2
    <ae9>   DW_AT_decl_line   : 473
    <aeb>   DW_AT_decl_column : 18
    <aec>   DW_AT_type        : <0xce>
    <af0>   DW_AT_data_member_location: 76
 <2><af1>: Abbrev Number: 4 (DW_TAG_member)
    <af2>   DW_AT_name        : (indirect string, offset: 0xb7209): ID_MFR
    <af6>   DW_AT_decl_file   : 2
    <af7>   DW_AT_decl_line   : 474
    <af9>   DW_AT_decl_column : 18
    <afa>   DW_AT_type        : <0xceb>
    <afe>   DW_AT_data_member_location: 80
 <2><aff>: Abbrev Number: 4 (DW_TAG_member)
    <b00>   DW_AT_name        : (indirect string, offset: 0xe8378): ID_ISAR
    <b04>   DW_AT_decl_file   : 2
    <b05>   DW_AT_decl_line   : 475
    <b07>   DW_AT_decl_column : 18
    <b08>   DW_AT_type        : <0xd05>
    <b0c>   DW_AT_data_member_location: 96
 <2><b0d>: Abbrev Number: 4 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0xef88c): RESERVED0
    <b12>   DW_AT_decl_file   : 2
    <b13>   DW_AT_decl_line   : 476
    <b15>   DW_AT_decl_column : 18
    <b16>   DW_AT_type        : <0x80b>
    <b1a>   DW_AT_data_member_location: 116
 <2><b1b>: Abbrev Number: 4 (DW_TAG_member)
    <b1c>   DW_AT_name        : (indirect string, offset: 0xee7ba): CLIDR
    <b20>   DW_AT_decl_file   : 2
    <b21>   DW_AT_decl_line   : 477
    <b23>   DW_AT_decl_column : 18
    <b24>   DW_AT_type        : <0xce>
    <b28>   DW_AT_data_member_location: 120
 <2><b29>: Abbrev Number: 32 (DW_TAG_member)
    <b2a>   DW_AT_name        : CTR
    <b2e>   DW_AT_decl_file   : 2
    <b2f>   DW_AT_decl_line   : 478
    <b31>   DW_AT_decl_column : 18
    <b31>   DW_AT_type        : <0xce>
    <b35>   DW_AT_data_member_location: 124
 <2><b36>: Abbrev Number: 4 (DW_TAG_member)
    <b37>   DW_AT_name        : (indirect string, offset: 0x1c8b): CCSIDR
    <b3b>   DW_AT_decl_file   : 2
    <b3c>   DW_AT_decl_line   : 479
    <b3e>   DW_AT_decl_column : 18
    <b3f>   DW_AT_type        : <0xce>
    <b43>   DW_AT_data_member_location: 128
 <2><b44>: Abbrev Number: 4 (DW_TAG_member)
    <b45>   DW_AT_name        : (indirect string, offset: 0x98ed6): CSSELR
    <b49>   DW_AT_decl_file   : 2
    <b4a>   DW_AT_decl_line   : 480
    <b4c>   DW_AT_decl_column : 18
    <b4d>   DW_AT_type        : <0xc9>
    <b51>   DW_AT_data_member_location: 132
 <2><b52>: Abbrev Number: 4 (DW_TAG_member)
    <b53>   DW_AT_name        : (indirect string, offset: 0x92d1a): CPACR
    <b57>   DW_AT_decl_file   : 2
    <b58>   DW_AT_decl_line   : 481
    <b5a>   DW_AT_decl_column : 18
    <b5b>   DW_AT_type        : <0xc9>
    <b5f>   DW_AT_data_member_location: 136
 <2><b60>: Abbrev Number: 4 (DW_TAG_member)
    <b61>   DW_AT_name        : (indirect string, offset: 0xef8f0): RESERVED3
    <b65>   DW_AT_decl_file   : 2
    <b66>   DW_AT_decl_line   : 482
    <b68>   DW_AT_decl_column : 18
    <b69>   DW_AT_type        : <0xd0a>
    <b6d>   DW_AT_data_member_location: 140
 <2><b6e>: Abbrev Number: 9 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x791a6): STIR
    <b73>   DW_AT_decl_file   : 2
    <b73>   DW_AT_decl_line   : 483
    <b75>   DW_AT_decl_column : 18
    <b75>   DW_AT_type        : <0xc9>
    <b79>   DW_AT_data_member_location: 512
 <2><b7b>: Abbrev Number: 9 (DW_TAG_member)
    <b7c>   DW_AT_name        : (indirect string, offset: 0xef8fa): RESERVED4
    <b80>   DW_AT_decl_file   : 2
    <b80>   DW_AT_decl_line   : 484
    <b82>   DW_AT_decl_column : 18
    <b82>   DW_AT_type        : <0xd1a>
    <b86>   DW_AT_data_member_location: 516
 <2><b88>: Abbrev Number: 9 (DW_TAG_member)
    <b89>   DW_AT_name        : (indirect string, offset: 0x97c0f): MVFR0
    <b8d>   DW_AT_decl_file   : 2
    <b8d>   DW_AT_decl_line   : 485
    <b8f>   DW_AT_decl_column : 18
    <b8f>   DW_AT_type        : <0xce>
    <b93>   DW_AT_data_member_location: 576
 <2><b95>: Abbrev Number: 9 (DW_TAG_member)
    <b96>   DW_AT_name        : (indirect string, offset: 0x97c15): MVFR1
    <b9a>   DW_AT_decl_file   : 2
    <b9a>   DW_AT_decl_line   : 486
    <b9c>   DW_AT_decl_column : 18
    <b9c>   DW_AT_type        : <0xce>
    <ba0>   DW_AT_data_member_location: 580
 <2><ba2>: Abbrev Number: 9 (DW_TAG_member)
    <ba3>   DW_AT_name        : (indirect string, offset: 0x97c1b): MVFR2
    <ba7>   DW_AT_decl_file   : 2
    <ba7>   DW_AT_decl_line   : 487
    <ba9>   DW_AT_decl_column : 18
    <ba9>   DW_AT_type        : <0xce>
    <bad>   DW_AT_data_member_location: 584
 <2><baf>: Abbrev Number: 9 (DW_TAG_member)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x97fcd): RESERVED5
    <bb4>   DW_AT_decl_file   : 2
    <bb4>   DW_AT_decl_line   : 488
    <bb6>   DW_AT_decl_column : 18
    <bb6>   DW_AT_type        : <0x80b>
    <bba>   DW_AT_data_member_location: 588
 <2><bbc>: Abbrev Number: 9 (DW_TAG_member)
    <bbd>   DW_AT_name        : (indirect string, offset: 0xd88cf): ICIALLU
    <bc1>   DW_AT_decl_file   : 2
    <bc1>   DW_AT_decl_line   : 489
    <bc3>   DW_AT_decl_column : 18
    <bc3>   DW_AT_type        : <0xc9>
    <bc7>   DW_AT_data_member_location: 592
 <2><bc9>: Abbrev Number: 9 (DW_TAG_member)
    <bca>   DW_AT_name        : (indirect string, offset: 0x9803f): RESERVED6
    <bce>   DW_AT_decl_file   : 2
    <bce>   DW_AT_decl_line   : 490
    <bd0>   DW_AT_decl_column : 18
    <bd0>   DW_AT_type        : <0x80b>
    <bd4>   DW_AT_data_member_location: 596
 <2><bd6>: Abbrev Number: 9 (DW_TAG_member)
    <bd7>   DW_AT_name        : (indirect string, offset: 0xf5e51): ICIMVAU
    <bdb>   DW_AT_decl_file   : 2
    <bdb>   DW_AT_decl_line   : 491
    <bdd>   DW_AT_decl_column : 18
    <bdd>   DW_AT_type        : <0xc9>
    <be1>   DW_AT_data_member_location: 600
 <2><be3>: Abbrev Number: 9 (DW_TAG_member)
    <be4>   DW_AT_name        : (indirect string, offset: 0x4e329): DCIMVAC
    <be8>   DW_AT_decl_file   : 2
    <be8>   DW_AT_decl_line   : 492
    <bea>   DW_AT_decl_column : 18
    <bea>   DW_AT_type        : <0xc9>
    <bee>   DW_AT_data_member_location: 604
 <2><bf0>: Abbrev Number: 9 (DW_TAG_member)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x8eb2e): DCISW
    <bf5>   DW_AT_decl_file   : 2
    <bf5>   DW_AT_decl_line   : 493
    <bf7>   DW_AT_decl_column : 18
    <bf7>   DW_AT_type        : <0xc9>
    <bfb>   DW_AT_data_member_location: 608
 <2><bfd>: Abbrev Number: 9 (DW_TAG_member)
    <bfe>   DW_AT_name        : (indirect string, offset: 0xe3f12): DCCMVAU
    <c02>   DW_AT_decl_file   : 2
    <c02>   DW_AT_decl_line   : 494
    <c04>   DW_AT_decl_column : 18
    <c04>   DW_AT_type        : <0xc9>
    <c08>   DW_AT_data_member_location: 612
 <2><c0a>: Abbrev Number: 9 (DW_TAG_member)
    <c0b>   DW_AT_name        : (indirect string, offset: 0xe3cbd): DCCMVAC
    <c0f>   DW_AT_decl_file   : 2
    <c0f>   DW_AT_decl_line   : 495
    <c11>   DW_AT_decl_column : 18
    <c11>   DW_AT_type        : <0xc9>
    <c15>   DW_AT_data_member_location: 616
 <2><c17>: Abbrev Number: 9 (DW_TAG_member)
    <c18>   DW_AT_name        : (indirect string, offset: 0x38d9): DCCSW
    <c1c>   DW_AT_decl_file   : 2
    <c1c>   DW_AT_decl_line   : 496
    <c1e>   DW_AT_decl_column : 18
    <c1e>   DW_AT_type        : <0xc9>
    <c22>   DW_AT_data_member_location: 620
 <2><c24>: Abbrev Number: 9 (DW_TAG_member)
    <c25>   DW_AT_name        : (indirect string, offset: 0x340f0): DCCIMVAC
    <c29>   DW_AT_decl_file   : 2
    <c29>   DW_AT_decl_line   : 497
    <c2b>   DW_AT_decl_column : 18
    <c2b>   DW_AT_type        : <0xc9>
    <c2f>   DW_AT_data_member_location: 624
 <2><c31>: Abbrev Number: 9 (DW_TAG_member)
    <c32>   DW_AT_name        : (indirect string, offset: 0x2ece7): DCCISW
    <c36>   DW_AT_decl_file   : 2
    <c36>   DW_AT_decl_line   : 498
    <c38>   DW_AT_decl_column : 18
    <c38>   DW_AT_type        : <0xc9>
    <c3c>   DW_AT_data_member_location: 628
 <2><c3e>: Abbrev Number: 9 (DW_TAG_member)
    <c3f>   DW_AT_name        : (indirect string, offset: 0xef9e3): RESERVED7
    <c43>   DW_AT_decl_file   : 2
    <c43>   DW_AT_decl_line   : 499
    <c45>   DW_AT_decl_column : 18
    <c45>   DW_AT_type        : <0xd2a>
    <c49>   DW_AT_data_member_location: 632
 <2><c4b>: Abbrev Number: 9 (DW_TAG_member)
    <c4c>   DW_AT_name        : (indirect string, offset: 0xaf1b6): ITCMCR
    <c50>   DW_AT_decl_file   : 2
    <c50>   DW_AT_decl_line   : 500
    <c52>   DW_AT_decl_column : 18
    <c52>   DW_AT_type        : <0xc9>
    <c56>   DW_AT_data_member_location: 656
 <2><c58>: Abbrev Number: 9 (DW_TAG_member)
    <c59>   DW_AT_name        : (indirect string, offset: 0x81ff4): DTCMCR
    <c5d>   DW_AT_decl_file   : 2
    <c5d>   DW_AT_decl_line   : 501
    <c5f>   DW_AT_decl_column : 18
    <c5f>   DW_AT_type        : <0xc9>
    <c63>   DW_AT_data_member_location: 660
 <2><c65>: Abbrev Number: 9 (DW_TAG_member)
    <c66>   DW_AT_name        : (indirect string, offset: 0x93d2b): AHBPCR
    <c6a>   DW_AT_decl_file   : 2
    <c6a>   DW_AT_decl_line   : 502
    <c6c>   DW_AT_decl_column : 18
    <c6c>   DW_AT_type        : <0xc9>
    <c70>   DW_AT_data_member_location: 664
 <2><c72>: Abbrev Number: 9 (DW_TAG_member)
    <c73>   DW_AT_name        : (indirect string, offset: 0xe825e): CACR
    <c77>   DW_AT_decl_file   : 2
    <c77>   DW_AT_decl_line   : 503
    <c79>   DW_AT_decl_column : 18
    <c79>   DW_AT_type        : <0xc9>
    <c7d>   DW_AT_data_member_location: 668
 <2><c7f>: Abbrev Number: 9 (DW_TAG_member)
    <c80>   DW_AT_name        : (indirect string, offset: 0xfb48f): AHBSCR
    <c84>   DW_AT_decl_file   : 2
    <c84>   DW_AT_decl_line   : 504
    <c86>   DW_AT_decl_column : 18
    <c86>   DW_AT_type        : <0xc9>
    <c8a>   DW_AT_data_member_location: 672
 <2><c8c>: Abbrev Number: 9 (DW_TAG_member)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x9807f): RESERVED8
    <c91>   DW_AT_decl_file   : 2
    <c91>   DW_AT_decl_line   : 505
    <c93>   DW_AT_decl_column : 18
    <c93>   DW_AT_type        : <0x80b>
    <c97>   DW_AT_data_member_location: 676
 <2><c99>: Abbrev Number: 9 (DW_TAG_member)
    <c9a>   DW_AT_name        : (indirect string, offset: 0x1355e): ABFSR
    <c9e>   DW_AT_decl_file   : 2
    <c9e>   DW_AT_decl_line   : 506
    <ca0>   DW_AT_decl_column : 18
    <ca0>   DW_AT_type        : <0xc9>
    <ca4>   DW_AT_data_member_location: 680
 <2><ca6>: Abbrev Number: 0
 <1><ca7>: Abbrev Number: 10 (DW_TAG_array_type)
    <ca8>   DW_AT_type        : <0xb3>
    <cac>   DW_AT_sibling     : <0xcb7>
 <2><cb0>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <cb1>   DW_AT_type        : <0x3d>
    <cb5>   DW_AT_upper_bound : 11
 <2><cb6>: Abbrev Number: 0
 <1><cb7>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <cb8>   DW_AT_type        : <0xca7>
 <1><cbc>: Abbrev Number: 10 (DW_TAG_array_type)
    <cbd>   DW_AT_type        : <0xce>
    <cc1>   DW_AT_sibling     : <0xccc>
 <2><cc5>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <cc6>   DW_AT_type        : <0x3d>
    <cca>   DW_AT_upper_bound : 1
 <2><ccb>: Abbrev Number: 0
 <1><ccc>: Abbrev Number: 15 (DW_TAG_const_type)
    <ccd>   DW_AT_type        : <0xcbc>
 <1><cd1>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <cd2>   DW_AT_type        : <0xccc>
 <1><cd6>: Abbrev Number: 10 (DW_TAG_array_type)
    <cd7>   DW_AT_type        : <0xce>
    <cdb>   DW_AT_sibling     : <0xce6>
 <2><cdf>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <ce0>   DW_AT_type        : <0x3d>
    <ce4>   DW_AT_upper_bound : 3
 <2><ce5>: Abbrev Number: 0
 <1><ce6>: Abbrev Number: 15 (DW_TAG_const_type)
    <ce7>   DW_AT_type        : <0xcd6>
 <1><ceb>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <cec>   DW_AT_type        : <0xce6>
 <1><cf0>: Abbrev Number: 10 (DW_TAG_array_type)
    <cf1>   DW_AT_type        : <0xce>
    <cf5>   DW_AT_sibling     : <0xd00>
 <2><cf9>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <cfa>   DW_AT_type        : <0x3d>
    <cfe>   DW_AT_upper_bound : 4
 <2><cff>: Abbrev Number: 0
 <1><d00>: Abbrev Number: 15 (DW_TAG_const_type)
    <d01>   DW_AT_type        : <0xcf0>
 <1><d05>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <d06>   DW_AT_type        : <0xd00>
 <1><d0a>: Abbrev Number: 10 (DW_TAG_array_type)
    <d0b>   DW_AT_type        : <0xbd>
    <d0f>   DW_AT_sibling     : <0xd1a>
 <2><d13>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <d14>   DW_AT_type        : <0x3d>
    <d18>   DW_AT_upper_bound : 92
 <2><d19>: Abbrev Number: 0
 <1><d1a>: Abbrev Number: 10 (DW_TAG_array_type)
    <d1b>   DW_AT_type        : <0xbd>
    <d1f>   DW_AT_sibling     : <0xd2a>
 <2><d23>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <d24>   DW_AT_type        : <0x3d>
    <d28>   DW_AT_upper_bound : 14
 <2><d29>: Abbrev Number: 0
 <1><d2a>: Abbrev Number: 10 (DW_TAG_array_type)
    <d2b>   DW_AT_type        : <0xbd>
    <d2f>   DW_AT_sibling     : <0xd3a>
 <2><d33>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <d34>   DW_AT_type        : <0x3d>
    <d38>   DW_AT_upper_bound : 5
 <2><d39>: Abbrev Number: 0
 <1><d3a>: Abbrev Number: 36 (DW_TAG_typedef)
    <d3b>   DW_AT_name        : (indirect string, offset: 0xbc42a): SCB_Type
    <d3f>   DW_AT_decl_file   : 2
    <d40>   DW_AT_decl_line   : 507
    <d42>   DW_AT_decl_column : 3
    <d43>   DW_AT_type        : <0x9fa>
 <1><d47>: Abbrev Number: 8 (DW_TAG_typedef)
    <d48>   DW_AT_name        : (indirect string, offset: 0x50c17): ConsoleHandle_t
    <d4c>   DW_AT_decl_file   : 17
    <d4d>   DW_AT_decl_line   : 17
    <d4e>   DW_AT_decl_column : 31
    <d4f>   DW_AT_type        : <0xd53>
 <1><d53>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d54>   DW_AT_byte_size   : 4
    <d54>   DW_AT_type        : <0xd58>
 <1><d58>: Abbrev Number: 43 (DW_TAG_structure_type)
    <d59>   DW_AT_name        : (indirect string, offset: 0x76c83): ConsoleHandle
    <d5d>   DW_AT_byte_size   : 1056
    <d5f>   DW_AT_decl_file   : 1
    <d5f>   DW_AT_decl_line   : 173
    <d60>   DW_AT_decl_column : 8
    <d61>   DW_AT_sibling     : <0xde8>
 <2><d65>: Abbrev Number: 3 (DW_TAG_member)
    <d66>   DW_AT_name        : (indirect string, offset: 0xf1b38): cState
    <d6a>   DW_AT_decl_file   : 1
    <d6b>   DW_AT_decl_line   : 176
    <d6c>   DW_AT_decl_column : 20
    <d6d>   DW_AT_type        : <0xf96>
    <d71>   DW_AT_data_member_location: 0
 <2><d72>: Abbrev Number: 3 (DW_TAG_member)
    <d73>   DW_AT_name        : (indirect string, offset: 0x5aa21): pState
    <d77>   DW_AT_decl_file   : 1
    <d78>   DW_AT_decl_line   : 177
    <d79>   DW_AT_decl_column : 20
    <d7a>   DW_AT_type        : <0x117a>
    <d7e>   DW_AT_data_member_location: 8
 <2><d7f>: Abbrev Number: 3 (DW_TAG_member)
    <d80>   DW_AT_name        : (indirect string, offset: 0xcbb18): tHandle
    <d84>   DW_AT_decl_file   : 1
    <d85>   DW_AT_decl_line   : 178
    <d86>   DW_AT_decl_column : 20
    <d87>   DW_AT_type        : <0x81b>
    <d8b>   DW_AT_data_member_location: 28
 <2><d8c>: Abbrev Number: 3 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x43435): cancel
    <d91>   DW_AT_decl_file   : 1
    <d92>   DW_AT_decl_line   : 179
    <d93>   DW_AT_decl_column : 20
    <d94>   DW_AT_type        : <0x2a>
    <d98>   DW_AT_data_member_location: 32
 <2><d99>: Abbrev Number: 3 (DW_TAG_member)
    <d9a>   DW_AT_name        : (indirect string, offset: 0xb0ecf): history
    <d9e>   DW_AT_decl_file   : 1
    <d9f>   DW_AT_decl_line   : 185
    <da0>   DW_AT_decl_column : 4
    <da1>   DW_AT_type        : <0x1186>
    <da5>   DW_AT_data_member_location: 36
 <2><da6>: Abbrev Number: 20 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0x8f13a): pendingRedirect
    <dab>   DW_AT_decl_file   : 1
    <dab>   DW_AT_decl_line   : 187
    <dac>   DW_AT_decl_column : 23
    <dad>   DW_AT_type        : <0x2a>
    <db1>   DW_AT_data_member_location: 1036
 <2><db3>: Abbrev Number: 20 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0x2d8a0): pendingRdStream
    <db8>   DW_AT_decl_file   : 1
    <db8>   DW_AT_decl_line   : 188
    <db9>   DW_AT_decl_column : 23
    <dba>   DW_AT_type        : <0xe17>
    <dbe>   DW_AT_data_member_location: 1040
 <2><dc0>: Abbrev Number: 20 (DW_TAG_member)
    <dc1>   DW_AT_name        : (indirect string, offset: 0xf2567): pendingWrStream
    <dc5>   DW_AT_decl_file   : 1
    <dc5>   DW_AT_decl_line   : 189
    <dc6>   DW_AT_decl_column : 23
    <dc7>   DW_AT_type        : <0xe41>
    <dcb>   DW_AT_data_member_location: 1044
 <2><dcd>: Abbrev Number: 20 (DW_TAG_member)
    <dce>   DW_AT_name        : (indirect string, offset: 0x4ed95): pendingRdCtx
    <dd2>   DW_AT_decl_file   : 1
    <dd2>   DW_AT_decl_line   : 190
    <dd3>   DW_AT_decl_column : 23
    <dd4>   DW_AT_type        : <0xfb>
    <dd8>   DW_AT_data_member_location: 1048
 <2><dda>: Abbrev Number: 20 (DW_TAG_member)
    <ddb>   DW_AT_name        : (indirect string, offset: 0x7b336): pendingWrCtx
    <ddf>   DW_AT_decl_file   : 1
    <ddf>   DW_AT_decl_line   : 191
    <de0>   DW_AT_decl_column : 23
    <de1>   DW_AT_type        : <0xfb>
    <de5>   DW_AT_data_member_location: 1052
 <2><de7>: Abbrev Number: 0
 <1><de8>: Abbrev Number: 8 (DW_TAG_typedef)
    <de9>   DW_AT_name        : (indirect string, offset: 0x56c24): CONSOLE_CommandFunc
    <ded>   DW_AT_decl_file   : 17
    <dee>   DW_AT_decl_line   : 30
    <def>   DW_AT_decl_column : 15
    <df0>   DW_AT_type        : <0xdf4>
 <1><df4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <df5>   DW_AT_byte_size   : 4
    <df5>   DW_AT_type        : <0xdf9>
 <1><df9>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <dfa>   DW_AT_prototyped  : 1
    <dfa>   DW_AT_type        : <0x2a>
    <dfe>   DW_AT_sibling     : <0xe12>
 <2><e02>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e03>   DW_AT_type        : <0x2a>
 <2><e07>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e08>   DW_AT_type        : <0xe12>
 <2><e0c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e0d>   DW_AT_type        : <0xfb>
 <2><e11>: Abbrev Number: 0
 <1><e12>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e13>   DW_AT_byte_size   : 4
    <e13>   DW_AT_type        : <0x58f>
 <1><e17>: Abbrev Number: 8 (DW_TAG_typedef)
    <e18>   DW_AT_name        : (indirect string, offset: 0x4b996): ConsoleReadStream_t
    <e1c>   DW_AT_decl_file   : 17
    <e1d>   DW_AT_decl_line   : 38
    <e1e>   DW_AT_decl_column : 15
    <e1f>   DW_AT_type        : <0xe23>
 <1><e23>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e24>   DW_AT_byte_size   : 4
    <e24>   DW_AT_type        : <0xe28>
 <1><e28>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <e29>   DW_AT_prototyped  : 1
    <e29>   DW_AT_type        : <0x2a>
    <e2d>   DW_AT_sibling     : <0xe41>
 <2><e31>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e32>   DW_AT_type        : <0xfb>
 <2><e36>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e37>   DW_AT_type        : <0x58f>
 <2><e3b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e3c>   DW_AT_type        : <0x2a>
 <2><e40>: Abbrev Number: 0
 <1><e41>: Abbrev Number: 8 (DW_TAG_typedef)
    <e42>   DW_AT_name        : (indirect string, offset: 0x57152): ConsoleWriteStream_t
    <e46>   DW_AT_decl_file   : 17
    <e47>   DW_AT_decl_line   : 46
    <e48>   DW_AT_decl_column : 15
    <e49>   DW_AT_type        : <0xe4d>
 <1><e4d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4e>   DW_AT_byte_size   : 4
    <e4e>   DW_AT_type        : <0xe52>
 <1><e52>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <e53>   DW_AT_prototyped  : 1
    <e53>   DW_AT_type        : <0x2a>
    <e57>   DW_AT_sibling     : <0xe6b>
 <2><e5b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e5c>   DW_AT_type        : <0xfb>
 <2><e60>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e61>   DW_AT_type        : <0x5c8>
 <2><e65>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <e66>   DW_AT_type        : <0x2a>
 <2><e6a>: Abbrev Number: 0
 <1><e6b>: Abbrev Number: 44 (DW_TAG_structure_type)
    <e6c>   DW_AT_byte_size   : 604
    <e6e>   DW_AT_decl_file   : 1
    <e6e>   DW_AT_decl_line   : 70
    <e6f>   DW_AT_decl_column : 5
    <e70>   DW_AT_sibling     : <0xed0>
 <2><e74>: Abbrev Number: 3 (DW_TAG_member)
    <e75>   DW_AT_name        : (indirect string, offset: 0x34b6d): func
    <e79>   DW_AT_decl_file   : 1
    <e7a>   DW_AT_decl_line   : 72
    <e7b>   DW_AT_decl_column : 26
    <e7c>   DW_AT_type        : <0xde8>
    <e80>   DW_AT_data_member_location: 0
 <2><e81>: Abbrev Number: 18 (DW_TAG_member)
    <e82>   DW_AT_name        : ctx
    <e86>   DW_AT_decl_file   : 1
    <e87>   DW_AT_decl_line   : 73
    <e88>   DW_AT_decl_column : 26
    <e89>   DW_AT_type        : <0xfb>
    <e8d>   DW_AT_data_member_location: 4
 <2><e8e>: Abbrev Number: 18 (DW_TAG_member)
    <e8f>   DW_AT_name        : cmd
    <e93>   DW_AT_decl_file   : 1
    <e94>   DW_AT_decl_line   : 74
    <e95>   DW_AT_decl_column : 23
    <e96>   DW_AT_type        : <0xed0>
    <e9a>   DW_AT_data_member_location: 8
 <2><e9b>: Abbrev Number: 3 (DW_TAG_member)
    <e9c>   DW_AT_name        : (indirect string, offset: 0xde9e1): cmdLen
    <ea0>   DW_AT_decl_file   : 1
    <ea1>   DW_AT_decl_line   : 75
    <ea2>   DW_AT_decl_column : 23
    <ea3>   DW_AT_type        : <0x2a>
    <ea7>   DW_AT_data_member_location: 76
 <2><ea8>: Abbrev Number: 3 (DW_TAG_member)
    <ea9>   DW_AT_name        : (indirect string, offset: 0xbc1f1): help
    <ead>   DW_AT_decl_file   : 1
    <eae>   DW_AT_decl_line   : 76
    <eaf>   DW_AT_decl_column : 23
    <eb0>   DW_AT_type        : <0xee0>
    <eb4>   DW_AT_data_member_location: 80
 <2><eb5>: Abbrev Number: 20 (DW_TAG_member)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x1fa2a): helpLen
    <eba>   DW_AT_decl_file   : 1
    <eba>   DW_AT_decl_line   : 77
    <ebb>   DW_AT_decl_column : 23
    <ebc>   DW_AT_type        : <0x2a>
    <ec0>   DW_AT_data_member_location: 596
 <2><ec2>: Abbrev Number: 20 (DW_TAG_member)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x2beb2): isAlias
    <ec7>   DW_AT_decl_file   : 1
    <ec7>   DW_AT_decl_line   : 78
    <ec8>   DW_AT_decl_column : 23
    <ec9>   DW_AT_type        : <0x2a>
    <ecd>   DW_AT_data_member_location: 600
 <2><ecf>: Abbrev Number: 0
 <1><ed0>: Abbrev Number: 10 (DW_TAG_array_type)
    <ed1>   DW_AT_type        : <0x599>
    <ed5>   DW_AT_sibling     : <0xee0>
 <2><ed9>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <eda>   DW_AT_type        : <0x3d>
    <ede>   DW_AT_upper_bound : 65
 <2><edf>: Abbrev Number: 0
 <1><ee0>: Abbrev Number: 10 (DW_TAG_array_type)
    <ee1>   DW_AT_type        : <0x599>
    <ee5>   DW_AT_sibling     : <0xef1>
 <2><ee9>: Abbrev Number: 45 (DW_TAG_subrange_type)
    <eea>   DW_AT_type        : <0x3d>
    <eee>   DW_AT_upper_bound : 513
 <2><ef0>: Abbrev Number: 0
 <1><ef1>: Abbrev Number: 37 (DW_TAG_structure_type)
    <ef2>   DW_AT_byte_size   : 8
    <ef3>   DW_AT_decl_file   : 1
    <ef4>   DW_AT_decl_line   : 81
    <ef5>   DW_AT_decl_column : 5
    <ef6>   DW_AT_sibling     : <0xf15>
 <2><efa>: Abbrev Number: 3 (DW_TAG_member)
    <efb>   DW_AT_name        : (indirect string, offset: 0xbcef7): le_next
    <eff>   DW_AT_decl_file   : 1
    <f00>   DW_AT_decl_line   : 81
    <f01>   DW_AT_decl_column : 5
    <f02>   DW_AT_type        : <0xf3d>
    <f06>   DW_AT_data_member_location: 0
 <2><f07>: Abbrev Number: 3 (DW_TAG_member)
    <f08>   DW_AT_name        : (indirect string, offset: 0xd869c): le_prev
    <f0c>   DW_AT_decl_file   : 1
    <f0d>   DW_AT_decl_line   : 81
    <f0e>   DW_AT_decl_column : 5
    <f0f>   DW_AT_type        : <0xf42>
    <f13>   DW_AT_data_member_location: 4
 <2><f14>: Abbrev Number: 0
 <1><f15>: Abbrev Number: 43 (DW_TAG_structure_type)
    <f16>   DW_AT_name        : (indirect string, offset: 0xb2134): cmdEntry
    <f1a>   DW_AT_byte_size   : 612
    <f1c>   DW_AT_decl_file   : 1
    <f1c>   DW_AT_decl_line   : 67
    <f1d>   DW_AT_decl_column : 16
    <f1e>   DW_AT_sibling     : <0xf3d>
 <2><f22>: Abbrev Number: 3 (DW_TAG_member)
    <f23>   DW_AT_name        : (indirect string, offset: 0x3d68d): content
    <f27>   DW_AT_decl_file   : 1
    <f28>   DW_AT_decl_line   : 79
    <f29>   DW_AT_decl_column : 4
    <f2a>   DW_AT_type        : <0xe6b>
    <f2e>   DW_AT_data_member_location: 0
 <2><f2f>: Abbrev Number: 20 (DW_TAG_member)
    <f30>   DW_AT_name        : (indirect string, offset: 0xfc10c): navigate
    <f34>   DW_AT_decl_file   : 1
    <f34>   DW_AT_decl_line   : 81
    <f35>   DW_AT_decl_column : 26
    <f36>   DW_AT_type        : <0xef1>
    <f3a>   DW_AT_data_member_location: 604
 <2><f3c>: Abbrev Number: 0
 <1><f3d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f3e>   DW_AT_byte_size   : 4
    <f3e>   DW_AT_type        : <0xf15>
 <1><f42>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f43>   DW_AT_byte_size   : 4
    <f43>   DW_AT_type        : <0xf3d>
 <1><f47>: Abbrev Number: 8 (DW_TAG_typedef)
    <f48>   DW_AT_name        : (indirect string, offset: 0xf68f0): cmdEntry_t
    <f4c>   DW_AT_decl_file   : 1
    <f4d>   DW_AT_decl_line   : 82
    <f4e>   DW_AT_decl_column : 3
    <f4f>   DW_AT_type        : <0xf15>
 <1><f53>: Abbrev Number: 23 (DW_TAG_structure_type)
    <f54>   DW_AT_name        : (indirect string, offset: 0x9784): cmd_list
    <f58>   DW_AT_byte_size   : 4
    <f59>   DW_AT_decl_file   : 1
    <f5a>   DW_AT_decl_line   : 89
    <f5b>   DW_AT_decl_column : 2
    <f5c>   DW_AT_sibling     : <0xf6e>
 <2><f60>: Abbrev Number: 3 (DW_TAG_member)
    <f61>   DW_AT_name        : (indirect string, offset: 0x96044): lh_first
    <f65>   DW_AT_decl_file   : 1
    <f66>   DW_AT_decl_line   : 89
    <f67>   DW_AT_decl_column : 2
    <f68>   DW_AT_type        : <0xf3d>
    <f6c>   DW_AT_data_member_location: 0
 <2><f6d>: Abbrev Number: 0
 <1><f6e>: Abbrev Number: 23 (DW_TAG_structure_type)
    <f6f>   DW_AT_name        : (indirect string, offset: 0xae8b8): cmdState
    <f73>   DW_AT_byte_size   : 8
    <f74>   DW_AT_decl_file   : 1
    <f75>   DW_AT_decl_line   : 85
    <f76>   DW_AT_decl_column : 16
    <f77>   DW_AT_sibling     : <0xf96>
 <2><f7b>: Abbrev Number: 3 (DW_TAG_member)
    <f7c>   DW_AT_name        : (indirect string, offset: 0xd0c74): lockGuard
    <f80>   DW_AT_decl_file   : 1
    <f81>   DW_AT_decl_line   : 88
    <f82>   DW_AT_decl_column : 32
    <f83>   DW_AT_type        : <0x932>
    <f87>   DW_AT_data_member_location: 0
 <2><f88>: Abbrev Number: 3 (DW_TAG_member)
    <f89>   DW_AT_name        : (indirect string, offset: 0xb8cb): commands
    <f8d>   DW_AT_decl_file   : 1
    <f8e>   DW_AT_decl_line   : 89
    <f8f>   DW_AT_decl_column : 32
    <f90>   DW_AT_type        : <0xf53>
    <f94>   DW_AT_data_member_location: 4
 <2><f95>: Abbrev Number: 0
 <1><f96>: Abbrev Number: 8 (DW_TAG_typedef)
    <f97>   DW_AT_name        : (indirect string, offset: 0x6ab3): cmdState_t
    <f9b>   DW_AT_decl_file   : 1
    <f9c>   DW_AT_decl_line   : 90
    <f9d>   DW_AT_decl_column : 3
    <f9e>   DW_AT_type        : <0xf6e>
 <1><fa2>: Abbrev Number: 33 (DW_TAG_enumeration_type)
    <fa3>   DW_AT_encoding    : 7	(unsigned)
    <fa3>   DW_AT_byte_size   : 1
    <fa4>   DW_AT_type        : <0x65>
    <fa8>   DW_AT_decl_file   : 1
    <fa9>   DW_AT_decl_line   : 95
    <faa>   DW_AT_decl_column : 1
    <faa>   DW_AT_sibling     : <0xfc1>
 <2><fae>: Abbrev Number: 6 (DW_TAG_enumerator)
    <faf>   DW_AT_name        : (indirect string, offset: 0x73c8f): csptNONE
    <fb3>   DW_AT_const_value : 0
 <2><fb4>: Abbrev Number: 6 (DW_TAG_enumerator)
    <fb5>   DW_AT_name        : (indirect string, offset: 0x8e709): csptCHARACTER
    <fb9>   DW_AT_const_value : 1
 <2><fba>: Abbrev Number: 6 (DW_TAG_enumerator)
    <fbb>   DW_AT_name        : (indirect string, offset: 0xd41ef): csptCONTROL
    <fbf>   DW_AT_const_value : 2
 <2><fc0>: Abbrev Number: 0
 <1><fc1>: Abbrev Number: 8 (DW_TAG_typedef)
    <fc2>   DW_AT_name        : (indirect string, offset: 0xdb71): cspTYPE
    <fc6>   DW_AT_decl_file   : 1
    <fc7>   DW_AT_decl_line   : 99
    <fc8>   DW_AT_decl_column : 3
    <fc9>   DW_AT_type        : <0xfa2>
 <1><fcd>: Abbrev Number: 33 (DW_TAG_enumeration_type)
    <fce>   DW_AT_encoding    : 7	(unsigned)
    <fce>   DW_AT_byte_size   : 2
    <fcf>   DW_AT_type        : <0x73>
    <fd3>   DW_AT_decl_file   : 1
    <fd4>   DW_AT_decl_line   : 104
    <fd5>   DW_AT_decl_column : 1
    <fd5>   DW_AT_sibling     : <0x10df>
 <2><fd9>: Abbrev Number: 6 (DW_TAG_enumerator)
    <fda>   DW_AT_name        : (indirect string, offset: 0x65e48): ctrlC0_NUL
    <fde>   DW_AT_const_value : 0
 <2><fdf>: Abbrev Number: 6 (DW_TAG_enumerator)
    <fe0>   DW_AT_name        : (indirect string, offset: 0x10b4a): ctrlC0_SOH
    <fe4>   DW_AT_const_value : 1
 <2><fe5>: Abbrev Number: 6 (DW_TAG_enumerator)
    <fe6>   DW_AT_name        : (indirect string, offset: 0x13744): ctrlC0_STX
    <fea>   DW_AT_const_value : 2
 <2><feb>: Abbrev Number: 6 (DW_TAG_enumerator)
    <fec>   DW_AT_name        : (indirect string, offset: 0x2b714): ctrlC0_ETX
    <ff0>   DW_AT_const_value : 3
 <2><ff1>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ff2>   DW_AT_name        : (indirect string, offset: 0x2640d): ctrlC0_EOT
    <ff6>   DW_AT_const_value : 4
 <2><ff7>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ff8>   DW_AT_name        : (indirect string, offset: 0x25bdd): ctrlC0_ENQ
    <ffc>   DW_AT_const_value : 5
 <2><ffd>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ffe>   DW_AT_name        : (indirect string, offset: 0x93242): ctrlC0_ACK
    <1002>   DW_AT_const_value : 6
 <2><1003>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1004>   DW_AT_name        : (indirect string, offset: 0xb7614): ctrlC0_BEL
    <1008>   DW_AT_const_value : 7
 <2><1009>: Abbrev Number: 6 (DW_TAG_enumerator)
    <100a>   DW_AT_name        : (indirect string, offset: 0x19a72): ctrlC0_BS
    <100e>   DW_AT_const_value : 8
 <2><100f>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1010>   DW_AT_name        : (indirect string, offset: 0x2d122): ctrlC0_TAB
    <1014>   DW_AT_const_value : 9
 <2><1015>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1016>   DW_AT_name        : (indirect string, offset: 0x1ee7a): ctrlC0_LF
    <101a>   DW_AT_const_value : 10
 <2><101b>: Abbrev Number: 6 (DW_TAG_enumerator)
    <101c>   DW_AT_name        : (indirect string, offset: 0x7395f): ctrlC0_VT
    <1020>   DW_AT_const_value : 11
 <2><1021>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1022>   DW_AT_name        : (indirect string, offset: 0x1bb00): ctrlC0_FF
    <1026>   DW_AT_const_value : 12
 <2><1027>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1028>   DW_AT_name        : (indirect string, offset: 0x1a34b): ctrlC0_CR
    <102c>   DW_AT_const_value : 13
 <2><102d>: Abbrev Number: 6 (DW_TAG_enumerator)
    <102e>   DW_AT_name        : (indirect string, offset: 0x2301b): ctrlC0_SO
    <1032>   DW_AT_const_value : 14
 <2><1033>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1034>   DW_AT_name        : (indirect string, offset: 0x22fbc): ctrlC0_SI
    <1038>   DW_AT_const_value : 15
 <2><1039>: Abbrev Number: 6 (DW_TAG_enumerator)
    <103a>   DW_AT_name        : (indirect string, offset: 0x149b): ctrlC0_DLE
    <103e>   DW_AT_const_value : 16
 <2><103f>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1040>   DW_AT_name        : (indirect string, offset: 0xfa84c): ctrlC0_DC1
    <1044>   DW_AT_const_value : 17
 <2><1045>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1046>   DW_AT_name        : (indirect string, offset: 0xfa857): ctrlC0_DC2
    <104a>   DW_AT_const_value : 18
 <2><104b>: Abbrev Number: 6 (DW_TAG_enumerator)
    <104c>   DW_AT_name        : (indirect string, offset: 0x516ad): ctrlC0_DC3
    <1050>   DW_AT_const_value : 19
 <2><1051>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1052>   DW_AT_name        : (indirect string, offset: 0xfa87b): ctrlC0_DC4
    <1056>   DW_AT_const_value : 20
 <2><1057>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1058>   DW_AT_name        : (indirect string, offset: 0x5b248): ctrlC0_NAK
    <105c>   DW_AT_const_value : 21
 <2><105d>: Abbrev Number: 6 (DW_TAG_enumerator)
    <105e>   DW_AT_name        : (indirect string, offset: 0x15f55): ctrlC0_SYN
    <1062>   DW_AT_const_value : 22
 <2><1063>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1064>   DW_AT_name        : (indirect string, offset: 0x28b09): ctrlC0_ETB
    <1068>   DW_AT_const_value : 23
 <2><1069>: Abbrev Number: 6 (DW_TAG_enumerator)
    <106a>   DW_AT_name        : (indirect string, offset: 0x89667): ctrlC0_CAN
    <106e>   DW_AT_const_value : 24
 <2><106f>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1070>   DW_AT_name        : (indirect string, offset: 0x1b3dd): ctrlC0_EM
    <1074>   DW_AT_const_value : 25
 <2><1075>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1076>   DW_AT_name        : (indirect string, offset: 0x137b): ctrlC0_SUB
    <107a>   DW_AT_const_value : 26
 <2><107b>: Abbrev Number: 6 (DW_TAG_enumerator)
    <107c>   DW_AT_name        : (indirect string, offset: 0x2951d): ctrlC0_ESC
    <1080>   DW_AT_const_value : 27
 <2><1081>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1082>   DW_AT_name        : (indirect string, offset: 0x1bced): ctrlC0_FS
    <1086>   DW_AT_const_value : 28
 <2><1087>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1088>   DW_AT_name        : (indirect string, offset: 0x64503): ctrlC0_GS
    <108c>   DW_AT_const_value : 29
 <2><108d>: Abbrev Number: 6 (DW_TAG_enumerator)
    <108e>   DW_AT_name        : (indirect string, offset: 0x6f90a): ctrlC0_RS
    <1092>   DW_AT_const_value : 30
 <2><1093>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1094>   DW_AT_name        : (indirect string, offset: 0x23fd9): ctrlC0_US
    <1098>   DW_AT_const_value : 31
 <2><1099>: Abbrev Number: 6 (DW_TAG_enumerator)
    <109a>   DW_AT_name        : (indirect string, offset: 0xd2b26): ctrlC0_DEL
    <109e>   DW_AT_const_value : 127
 <2><109f>: Abbrev Number: 22 (DW_TAG_enumerator)
    <10a0>   DW_AT_name        : (indirect string, offset: 0x31eef): ctrlC1_MASK
    <10a4>   DW_AT_const_value : 256
 <2><10a6>: Abbrev Number: 22 (DW_TAG_enumerator)
    <10a7>   DW_AT_name        : (indirect string, offset: 0x4ff14): ctrlC1_DCS
    <10ab>   DW_AT_const_value : 257
 <2><10ad>: Abbrev Number: 22 (DW_TAG_enumerator)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x341b0): ctrlC1_CSI
    <10b2>   DW_AT_const_value : 258
 <2><10b4>: Abbrev Number: 22 (DW_TAG_enumerator)
    <10b5>   DW_AT_name        : (indirect string, offset: 0x64184): ctrlC1_SOS
    <10b9>   DW_AT_const_value : 259
 <2><10bb>: Abbrev Number: 22 (DW_TAG_enumerator)
    <10bc>   DW_AT_name        : (indirect string, offset: 0x516d8): ctrlC1_PM
    <10c0>   DW_AT_const_value : 260
 <2><10c2>: Abbrev Number: 22 (DW_TAG_enumerator)
    <10c3>   DW_AT_name        : (indirect string, offset: 0xea733): ctrlC1_APC
    <10c7>   DW_AT_const_value : 261
 <2><10c9>: Abbrev Number: 22 (DW_TAG_enumerator)
    <10ca>   DW_AT_name        : (indirect string, offset: 0x52fac): ctrlC1_ST
    <10ce>   DW_AT_const_value : 262
 <2><10d0>: Abbrev Number: 22 (DW_TAG_enumerator)
    <10d1>   DW_AT_name        : (indirect string, offset: 0x88a5b): ctrlUNKNOWN
    <10d5>   DW_AT_const_value : 4096
 <2><10d7>: Abbrev Number: 22 (DW_TAG_enumerator)
    <10d8>   DW_AT_name        : (indirect string, offset: 0xec64b): ctrlOVERFLOW
    <10dc>   DW_AT_const_value : 4097
 <2><10de>: Abbrev Number: 0
 <1><10df>: Abbrev Number: 8 (DW_TAG_typedef)
    <10e0>   DW_AT_name        : (indirect string, offset: 0x4953a): ctrlCodes_t
    <10e4>   DW_AT_decl_file   : 1
    <10e5>   DW_AT_decl_line   : 147
    <10e6>   DW_AT_decl_column : 3
    <10e7>   DW_AT_type        : <0xfcd>
 <1><10eb>: Abbrev Number: 33 (DW_TAG_enumeration_type)
    <10ec>   DW_AT_encoding    : 7	(unsigned)
    <10ec>   DW_AT_byte_size   : 1
    <10ed>   DW_AT_type        : <0x65>
    <10f1>   DW_AT_decl_file   : 1
    <10f2>   DW_AT_decl_line   : 152
    <10f3>   DW_AT_decl_column : 1
    <10f3>   DW_AT_sibling     : <0x1116>
 <2><10f7>: Abbrev Number: 6 (DW_TAG_enumerator)
    <10f8>   DW_AT_name        : (indirect string, offset: 0x73b44): ctrlpsIDLE_DETECT
    <10fc>   DW_AT_const_value : 0
 <2><10fd>: Abbrev Number: 6 (DW_TAG_enumerator)
    <10fe>   DW_AT_name        : (indirect string, offset: 0x998ff): ctrlpsSTART_C1
    <1102>   DW_AT_const_value : 1
 <2><1103>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1104>   DW_AT_name        : (indirect string, offset: 0xc8ab1): ctrlpsHANDLE_CSI
    <1108>   DW_AT_const_value : 2
 <2><1109>: Abbrev Number: 6 (DW_TAG_enumerator)
    <110a>   DW_AT_name        : (indirect string, offset: 0x661c5): ctrlpsHANDLE_ST_1
    <110e>   DW_AT_const_value : 3
 <2><110f>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1110>   DW_AT_name        : (indirect string, offset: 0x46ccd): ctrlpsHANDLE_ST_2
    <1114>   DW_AT_const_value : 4
 <2><1115>: Abbrev Number: 0
 <1><1116>: Abbrev Number: 8 (DW_TAG_typedef)
    <1117>   DW_AT_name        : (indirect string, offset: 0xc8d31): ctrlpStates_t
    <111b>   DW_AT_decl_file   : 1
    <111c>   DW_AT_decl_line   : 158
    <111d>   DW_AT_decl_column : 3
    <111e>   DW_AT_type        : <0x10eb>
 <1><1122>: Abbrev Number: 37 (DW_TAG_structure_type)
    <1123>   DW_AT_byte_size   : 20
    <1124>   DW_AT_decl_file   : 1
    <1125>   DW_AT_decl_line   : 161
    <1126>   DW_AT_decl_column : 9
    <1127>   DW_AT_sibling     : <0x117a>
 <2><112b>: Abbrev Number: 3 (DW_TAG_member)
    <112c>   DW_AT_name        : (indirect string, offset: 0x106e7b): state
    <1130>   DW_AT_decl_file   : 1
    <1131>   DW_AT_decl_line   : 164
    <1132>   DW_AT_decl_column : 16
    <1133>   DW_AT_type        : <0x1116>
    <1137>   DW_AT_data_member_location: 0
 <2><1138>: Abbrev Number: 3 (DW_TAG_member)
    <1139>   DW_AT_name        : (indirect string, offset: 0xe7c65): type
    <113d>   DW_AT_decl_file   : 1
    <113e>   DW_AT_decl_line   : 165
    <113f>   DW_AT_decl_column : 16
    <1140>   DW_AT_type        : <0x10df>
    <1144>   DW_AT_data_member_location: 2
 <2><1145>: Abbrev Number: 18 (DW_TAG_member)
    <1146>   DW_AT_name        : ptr
    <114a>   DW_AT_decl_file   : 1
    <114b>   DW_AT_decl_line   : 166
    <114c>   DW_AT_decl_column : 16
    <114d>   DW_AT_type        : <0x3d>
    <1151>   DW_AT_data_member_location: 4
 <2><1152>: Abbrev Number: 3 (DW_TAG_member)
    <1153>   DW_AT_name        : (indirect string, offset: 0x10717): length
    <1157>   DW_AT_decl_file   : 1
    <1158>   DW_AT_decl_line   : 167
    <1159>   DW_AT_decl_column : 16
    <115a>   DW_AT_type        : <0x3d>
    <115e>   DW_AT_data_member_location: 8
 <2><115f>: Abbrev Number: 3 (DW_TAG_member)
    <1160>   DW_AT_name        : (indirect string, offset: 0x266f1): maxLength
    <1164>   DW_AT_decl_file   : 1
    <1165>   DW_AT_decl_line   : 168
